# Comparing `tmp/fast_edit_distance-1.0.1-cp39-cp39-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_24_x86_64.whl.zip` & `tmp/fast_edit_distance-1.2.0-cp39-cp39-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_24_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,10 +1,10 @@
-Zip file size: 48703 bytes, number of entries: 8
-drwxr-xr-x  2.0 unx        0 b- stor 23-Jun-14 06:10 fast_edit_distance.libs/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Jun-14 06:10 fast_edit_distance-1.0.1.dist-info/
--rwxr-xr-x  2.0 unx   125048 b- defN 23-Jun-14 06:10 fast_edit_distance.cpython-39-x86_64-linux-gnu.so
--rw-rw-r--  2.0 unx       19 b- defN 23-Jun-14 06:10 fast_edit_distance-1.0.1.dist-info/top_level.txt
--rw-rw-r--  2.0 unx      555 b- defN 23-Jun-14 06:10 fast_edit_distance-1.0.1.dist-info/RECORD
--rw-r--r--  2.0 unx      181 b- defN 23-Jun-14 06:10 fast_edit_distance-1.0.1.dist-info/WHEEL
--rw-rw-r--  2.0 unx     1066 b- defN 23-Jun-14 06:10 fast_edit_distance-1.0.1.dist-info/LICENSE
--rw-r--r--  2.0 unx      416 b- defN 23-Jun-14 06:10 fast_edit_distance-1.0.1.dist-info/METADATA
-8 files, 127285 bytes uncompressed, 47429 bytes compressed:  62.7%
+Zip file size: 61402 bytes, number of entries: 8
+drwxr-xr-x  2.0 unx        0 b- stor 23-Jul-06 03:00 fast_edit_distance.libs/
+drwxr-xr-x  2.0 unx        0 b- stor 23-Jul-06 03:00 fast_edit_distance-1.2.0.dist-info/
+-rwxr-xr-x  2.0 unx   168688 b- defN 23-Jul-06 03:00 fast_edit_distance.cpython-39-x86_64-linux-gnu.so

  <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
-    <c>   DW_AT_producer    : (strp) (offset: 0x2de0): GNU C11 6.3.0 20170516 -mtune=generic -march=x86-64 -g -O3 -fwrapv -fPIC
+    <c>   DW_AT_producer    : (strp) (offset: 0x3036): GNU C11 6.3.0 20170516 -mtune=generic -march=x86-64 -g -O3 -fwrapv -fPIC
     <10>   DW_AT_language    : (data1) 12	(ANSI C99)
-    <11>   DW_AT_name        : (strp) (offset: 0x2373): src/fast_edit_distance.c
+    <11>   DW_AT_name        : (strp) (offset: 0x2536): src/fast_edit_distance.c
     <15>   DW_AT_comp_dir    : (string) /io
-    <19>   DW_AT_ranges      : (sec_offset) 0x1790
+    <19>   DW_AT_ranges      : (sec_offset) 0x2340
     <1d>   DW_AT_low_pc      : (addr) 0
     <25>   DW_AT_stmt_list   : (sec_offset) 0
  <1><29>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2a>   DW_AT_name        : (strp) (offset: 0x14cd): size_t
+    <2a>   DW_AT_name        : (strp) (offset: 0x15c1): size_t
     <2e>   DW_AT_decl_file   : (data1) 4
     <2f>   DW_AT_decl_line   : (data1) 216
     <30>   DW_AT_type        : (ref4) <0x34>, long unsigned int
  <1><34>: Abbrev Number: 3 (DW_TAG_base_type)
     <35>   DW_AT_byte_size   : (data1) 8
     <36>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <37>   DW_AT_name        : (strp) (offset: 0x28d5): long unsigned int
+    <37>   DW_AT_name        : (strp) (offset: 0x2b14): long unsigned int
  <1><3b>: Abbrev Number: 3 (DW_TAG_base_type)
     <3c>   DW_AT_byte_size   : (data1) 1
     <3d>   DW_AT_encoding    : (data1) 8	(unsigned char)
-    <3e>   DW_AT_name        : (strp) (offset: 0xc80): unsigned char
+    <3e>   DW_AT_name        : (strp) (offset: 0xd16): unsigned char
  <1><42>: Abbrev Number: 4 (DW_TAG_const_type)
     <43>   DW_AT_type        : (ref4) <0x3b>, unsigned char
  <1><47>: Abbrev Number: 3 (DW_TAG_base_type)
     <48>   DW_AT_byte_size   : (data1) 2
     <49>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <4a>   DW_AT_name        : (strp) (offset: 0x1aa4): short unsigned int
+    <4a>   DW_AT_name        : (strp) (offset: 0x1bbe): short unsigned int
  <1><4e>: Abbrev Number: 3 (DW_TAG_base_type)
     <4f>   DW_AT_byte_size   : (data1) 4
     <50>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <51>   DW_AT_name        : (strp) (offset: 0x28da): unsigned int
+    <51>   DW_AT_name        : (strp) (offset: 0x2b19): unsigned int
  <1><55>: Abbrev Number: 4 (DW_TAG_const_type)
     <56>   DW_AT_type        : (ref4) <0x4e>, unsigned int
  <1><5a>: Abbrev Number: 3 (DW_TAG_base_type)
     <5b>   DW_AT_byte_size   : (data1) 1
     <5c>   DW_AT_encoding    : (data1) 6	(signed char)
-    <5d>   DW_AT_name        : (strp) (offset: 0xc82): signed char
+    <5d>   DW_AT_name        : (strp) (offset: 0xd18): signed char
  <1><61>: Abbrev Number: 3 (DW_TAG_base_type)
     <62>   DW_AT_byte_size   : (data1) 2
     <63>   DW_AT_encoding    : (data1) 5	(signed)
-    <64>   DW_AT_name        : (strp) (offset: 0x30aa): short int
+    <64>   DW_AT_name        : (strp) (offset: 0x3333): short int
  <1><68>: Abbrev Number: 5 (DW_TAG_base_type)
     <69>   DW_AT_byte_size   : (data1) 4
     <6a>   DW_AT_encoding    : (data1) 5	(signed)
     <6b>   DW_AT_name        : (string) int
  <1><6f>: Abbrev Number: 4 (DW_TAG_const_type)
     <70>   DW_AT_type        : (ref4) <0x68>, int
  <1><74>: Abbrev Number: 3 (DW_TAG_base_type)
     <75>   DW_AT_byte_size   : (data1) 8
     <76>   DW_AT_encoding    : (data1) 5	(signed)
-    <77>   DW_AT_name        : (strp) (offset: 0x2c8d): long int
+    <77>   DW_AT_name        : (strp) (offset: 0x2ee7): long int
  <1><7b>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7c>   DW_AT_name        : (strp) (offset: 0x440): __off_t
+    <7c>   DW_AT_name        : (strp) (offset: 0x45a): __off_t
     <80>   DW_AT_decl_file   : (data1) 5
     <81>   DW_AT_decl_line   : (data1) 131
     <82>   DW_AT_type        : (ref4) <0x74>, long int
  <1><86>: Abbrev Number: 2 (DW_TAG_typedef)
-    <87>   DW_AT_name        : (strp) (offset: 0x1b79): __off64_t
+    <87>   DW_AT_name        : (strp) (offset: 0x1c9e): __off64_t
     <8b>   DW_AT_decl_file   : (data1) 5
     <8c>   DW_AT_decl_line   : (data1) 132
     <8d>   DW_AT_type        : (ref4) <0x74>, long int
- <1><91>: Abbrev Number: 3 (DW_TAG_base_type)
-    <92>   DW_AT_byte_size   : (data1) 8
-    <93>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <94>   DW_AT_name        : (strp) (offset: 0x1a75): sizetype
- <1><98>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <99>   DW_AT_byte_size   : (data1) 8
- <1><9a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <9b>   DW_AT_name        : (strp) (offset: 0x16d6): __ssize_t
-    <9f>   DW_AT_decl_file   : (data1) 5
-    <a0>   DW_AT_decl_line   : (data1) 172
-    <a1>   DW_AT_type        : (ref4) <0x74>, long int
- <1><a5>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <a6>   DW_AT_byte_size   : (data1) 8
-    <a7>   DW_AT_type        : (ref4) <0xab>, char
- <1><ab>: Abbrev Number: 3 (DW_TAG_base_type)
-    <ac>   DW_AT_byte_size   : (data1) 1
-    <ad>   DW_AT_encoding    : (data1) 6	(signed char)
-    <ae>   DW_AT_name        : (strp) (offset: 0xc89): char
- <1><b2>: Abbrev Number: 4 (DW_TAG_const_type)
-    <b3>   DW_AT_type        : (ref4) <0xab>, char
- <1><b7>: Abbrev Number: 2 (DW_TAG_typedef)
-    <b8>   DW_AT_name        : (strp) (offset: 0x2237): FILE
-    <bc>   DW_AT_decl_file   : (data1) 6
-    <bd>   DW_AT_decl_line   : (data1) 48
-    <be>   DW_AT_type        : (ref4) <0xc2>, _IO_FILE
- <1><c2>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <c3>   DW_AT_name        : (strp) (offset: 0x2233): _IO_FILE
-    <c7>   DW_AT_byte_size   : (data1) 216
-    <c8>   DW_AT_decl_file   : (data1) 7
-    <c9>   DW_AT_decl_line   : (data1) 241
-    <ca>   DW_AT_sibling     : (ref4) <0x23f>
- <2><ce>: Abbrev Number: 9 (DW_TAG_member)
-    <cf>   DW_AT_name        : (strp) (offset: 0x1815): _flags
-    <d3>   DW_AT_decl_file   : (data1) 7
-    <d4>   DW_AT_decl_line   : (data1) 242
-    <d5>   DW_AT_type        : (ref4) <0x68>, int
-    <d9>   DW_AT_data_member_location: (data1) 0
- <2><da>: Abbrev Number: 9 (DW_TAG_member)
-    <db>   DW_AT_name        : (strp) (offset: 0x29fe): _IO_read_ptr
-    <df>   DW_AT_decl_file   : (data1) 7
-    <e0>   DW_AT_decl_line   : (data1) 247
-    <e1>   DW_AT_type        : (ref4) <0xa5>, char
-    <e5>   DW_AT_data_member_location: (data1) 8
- <2><e6>: Abbrev Number: 9 (DW_TAG_member)
-    <e7>   DW_AT_name        : (strp) (offset: 0x21df): _IO_read_end
-    <eb>   DW_AT_decl_file   : (data1) 7
-    <ec>   DW_AT_decl_line   : (data1) 248
-    <ed>   DW_AT_type        : (ref4) <0xa5>, char
-    <f1>   DW_AT_data_member_location: (data1) 16
- <2><f2>: Abbrev Number: 9 (DW_TAG_member)
-    <f3>   DW_AT_name        : (strp) (offset: 0x1ba7): _IO_read_base
-    <f7>   DW_AT_decl_file   : (data1) 7
-    <f8>   DW_AT_decl_line   : (data1) 249
-    <f9>   DW_AT_type        : (ref4) <0xa5>, char
-    <fd>   DW_AT_data_member_location: (data1) 24
- <2><fe>: Abbrev Number: 9 (DW_TAG_member)
-    <ff>   DW_AT_name        : (strp) (offset: 0x1cd2): _IO_write_base
-    <103>   DW_AT_decl_file   : (data1) 7
-    <104>   DW_AT_decl_line   : (data1) 250
-    <105>   DW_AT_type        : (ref4) <0xa5>, char
-    <109>   DW_AT_data_member_location: (data1) 32
- <2><10a>: Abbrev Number: 9 (DW_TAG_member)
-    <10b>   DW_AT_name        : (strp) (offset: 0x106a): _IO_write_ptr
-    <10f>   DW_AT_decl_file   : (data1) 7
-    <110>   DW_AT_decl_line   : (data1) 251
-    <111>   DW_AT_type        : (ref4) <0xa5>, char
-    <115>   DW_AT_data_member_location: (data1) 40
- <2><116>: Abbrev Number: 9 (DW_TAG_member)
-    <117>   DW_AT_name        : (strp) (offset: 0x74d): _IO_write_end
-    <11b>   DW_AT_decl_file   : (data1) 7
-    <11c>   DW_AT_decl_line   : (data1) 252
-    <11d>   DW_AT_type        : (ref4) <0xa5>, char
-    <121>   DW_AT_data_member_location: (data1) 48
- <2><122>: Abbrev Number: 9 (DW_TAG_member)
-    <123>   DW_AT_name        : (strp) (offset: 0x2180): _IO_buf_base
-    <127>   DW_AT_decl_file   : (data1) 7
-    <128>   DW_AT_decl_line   : (data1) 253
-    <129>   DW_AT_type        : (ref4) <0xa5>, char
-    <12d>   DW_AT_data_member_location: (data1) 56
- <2><12e>: Abbrev Number: 9 (DW_TAG_member)
-    <12f>   DW_AT_name        : (strp) (offset: 0x1bf1): _IO_buf_end
-    <133>   DW_AT_decl_file   : (data1) 7
-    <134>   DW_AT_decl_line   : (data1) 254
-    <135>   DW_AT_type        : (ref4) <0xa5>, char
-    <139>   DW_AT_data_member_location: (data1) 64
- <2><13a>: Abbrev Number: 10 (DW_TAG_member)
-    <13b>   DW_AT_name        : (strp) (offset: 0x13bf): _IO_save_base
-    <13f>   DW_AT_decl_file   : (data1) 7
-    <140>   DW_AT_decl_line   : (data2) 256
-    <142>   DW_AT_type        : (ref4) <0xa5>, char
-    <146>   DW_AT_data_member_location: (data1) 72
- <2><147>: Abbrev Number: 10 (DW_TAG_member)
-    <148>   DW_AT_name        : (strp) (offset: 0x29ee): _IO_backup_base
-    <14c>   DW_AT_decl_file   : (data1) 7
-    <14d>   DW_AT_decl_line   : (data2) 257
-    <14f>   DW_AT_type        : (ref4) <0xa5>, char
-    <153>   DW_AT_data_member_location: (data1) 80
- <2><154>: Abbrev Number: 10 (DW_TAG_member)
-    <155>   DW_AT_name        : (strp) (offset: 0x1953): _IO_save_end
-    <159>   DW_AT_decl_file   : (data1) 7
-    <15a>   DW_AT_decl_line   : (data2) 258
-    <15c>   DW_AT_type        : (ref4) <0xa5>, char
-    <160>   DW_AT_data_member_location: (data1) 88
- <2><161>: Abbrev Number: 10 (DW_TAG_member)
-    <162>   DW_AT_name        : (strp) (offset: 0x2497): _markers
-    <166>   DW_AT_decl_file   : (data1) 7
-    <167>   DW_AT_decl_line   : (data2) 260
-    <169>   DW_AT_type        : (ref4) <0x277>, _IO_marker
-    <16d>   DW_AT_data_member_location: (data1) 96
- <2><16e>: Abbrev Number: 10 (DW_TAG_member)
-    <16f>   DW_AT_name        : (strp) (offset: 0xbfc): _chain
-    <173>   DW_AT_decl_file   : (data1) 7
-    <174>   DW_AT_decl_line   : (data2) 262
-    <176>   DW_AT_type        : (ref4) <0x27d>, _IO_FILE
-    <17a>   DW_AT_data_member_location: (data1) 104
- <2><17b>: Abbrev Number: 10 (DW_TAG_member)
-    <17c>   DW_AT_name        : (strp) (offset: 0x7d): _fileno
-    <180>   DW_AT_decl_file   : (data1) 7
-    <181>   DW_AT_decl_line   : (data2) 264
-    <183>   DW_AT_type        : (ref4) <0x68>, int
-    <187>   DW_AT_data_member_location: (data1) 112
- <2><188>: Abbrev Number: 10 (DW_TAG_member)
-    <189>   DW_AT_name        : (strp) (offset: 0x2ce8): _flags2
-    <18d>   DW_AT_decl_file   : (data1) 7
-    <18e>   DW_AT_decl_line   : (data2) 268
-    <190>   DW_AT_type        : (ref4) <0x68>, int
-    <194>   DW_AT_data_member_location: (data1) 116
- <2><195>: Abbrev Number: 10 (DW_TAG_member)
-    <196>   DW_AT_name        : (strp) (offset: 0x2b7a): _old_offset
-    <19a>   DW_AT_decl_file   : (data1) 7
-    <19b>   DW_AT_decl_line   : (data2) 270
-    <19d>   DW_AT_type        : (ref4) <0x7b>, __off_t, long int
-    <1a1>   DW_AT_data_member_location: (data1) 120
- <2><1a2>: Abbrev Number: 10 (DW_TAG_member)
-    <1a3>   DW_AT_name        : (strp) (offset: 0x28f7): _cur_column
-    <1a7>   DW_AT_decl_file   : (data1) 7
-    <1a8>   DW_AT_decl_line   : (data2) 274
-    <1aa>   DW_AT_type        : (ref4) <0x47>, short unsigned int
-    <1ae>   DW_AT_data_member_location: (data1) 128
- <2><1af>: Abbrev Number: 10 (DW_TAG_member)
-    <1b0>   DW_AT_name        : (strp) (offset: 0x30cd): _vtable_offset
-    <1b4>   DW_AT_decl_file   : (data1) 7
-    <1b5>   DW_AT_decl_line   : (data2) 275
-    <1b7>   DW_AT_type        : (ref4) <0x5a>, signed char
-    <1bb>   DW_AT_data_member_location: (data1) 130
- <2><1bc>: Abbrev Number: 10 (DW_TAG_member)
-    <1bd>   DW_AT_name        : (strp) (offset: 0x2a6): _shortbuf
-    <1c1>   DW_AT_decl_file   : (data1) 7
-    <1c2>   DW_AT_decl_line   : (data2) 276
-    <1c4>   DW_AT_type        : (ref4) <0x283>, char
-    <1c8>   DW_AT_data_member_location: (data1) 131
- <2><1c9>: Abbrev Number: 10 (DW_TAG_member)
-    <1ca>   DW_AT_name        : (strp) (offset: 0x4ca): _lock
-    <1ce>   DW_AT_decl_file   : (data1) 7
-    <1cf>   DW_AT_decl_line   : (data2) 280
-    <1d1>   DW_AT_type        : (ref4) <0x293>, _IO_lock_t
-    <1d5>   DW_AT_data_member_location: (data1) 136
- <2><1d6>: Abbrev Number: 10 (DW_TAG_member)
-    <1d7>   DW_AT_name        : (strp) (offset: 0x2b7e): _offset
-    <1db>   DW_AT_decl_file   : (data1) 7
-    <1dc>   DW_AT_decl_line   : (data2) 289
-    <1de>   DW_AT_type        : (ref4) <0x86>, __off64_t, long int
-    <1e2>   DW_AT_data_member_location: (data1) 144
- <2><1e3>: Abbrev Number: 10 (DW_TAG_member)
-    <1e4>   DW_AT_name        : (strp) (offset: 0x2433): __pad1
-    <1e8>   DW_AT_decl_file   : (data1) 7
-    <1e9>   DW_AT_decl_line   : (data2) 297
-    <1eb>   DW_AT_type        : (ref4) <0x98>
-    <1ef>   DW_AT_data_member_location: (data1) 152
- <2><1f0>: Abbrev Number: 10 (DW_TAG_member)
-    <1f1>   DW_AT_name        : (strp) (offset: 0x14d4): __pad2
-    <1f5>   DW_AT_decl_file   : (data1) 7
-    <1f6>   DW_AT_decl_line   : (data2) 298
-    <1f8>   DW_AT_type        : (ref4) <0x98>
-    <1fc>   DW_AT_data_member_location: (data1) 160
- <2><1fd>: Abbrev Number: 10 (DW_TAG_member)
-    <1fe>   DW_AT_name        : (strp) (offset: 0x243a): __pad3
-    <202>   DW_AT_decl_file   : (data1) 7
-    <203>   DW_AT_decl_line   : (data2) 299
-    <205>   DW_AT_type        : (ref4) <0x98>
-    <209>   DW_AT_data_member_location: (data1) 168
- <2><20a>: Abbrev Number: 10 (DW_TAG_member)
-    <20b>   DW_AT_name        : (strp) (offset: 0x2441): __pad4
-    <20f>   DW_AT_decl_file   : (data1) 7
-    <210>   DW_AT_decl_line   : (data2) 300
-    <212>   DW_AT_type        : (ref4) <0x98>
-    <216>   DW_AT_data_member_location: (data1) 176
- <2><217>: Abbrev Number: 10 (DW_TAG_member)
-    <218>   DW_AT_name        : (strp) (offset: 0x2448): __pad5
-    <21c>   DW_AT_decl_file   : (data1) 7
-    <21d>   DW_AT_decl_line   : (data2) 302
-    <21f>   DW_AT_type        : (ref4) <0x29>, size_t, long unsigned int
-    <223>   DW_AT_data_member_location: (data1) 184
- <2><224>: Abbrev Number: 10 (DW_TAG_member)
-    <225>   DW_AT_name        : (strp) (offset: 0x1c98): _mode
-    <229>   DW_AT_decl_file   : (data1) 7
-    <22a>   DW_AT_decl_line   : (data2) 303
-    <22c>   DW_AT_type        : (ref4) <0x68>, int
-    <230>   DW_AT_data_member_location: (data1) 192
- <2><231>: Abbrev Number: 10 (DW_TAG_member)
-    <232>   DW_AT_name        : (strp) (offset: 0x62): _unused2
-    <236>   DW_AT_decl_file   : (data1) 7
-    <237>   DW_AT_decl_line   : (data2) 305
-    <239>   DW_AT_type        : (ref4) <0x299>, char
-    <23d>   DW_AT_data_member_location: (data1) 196
- <2><23e>: Abbrev Number: 0
- <1><23f>: Abbrev Number: 11 (DW_TAG_typedef)
-    <240>   DW_AT_name        : (strp) (offset: 0xd11): _IO_lock_t
-    <244>   DW_AT_decl_file   : (data1) 7
-    <245>   DW_AT_decl_line   : (data1) 150
- <1><246>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <247>   DW_AT_name        : (strp) (offset: 0x1dfc): _IO_marker
-    <24b>   DW_AT_byte_size   : (data1) 24
-    <24c>   DW_AT_decl_file   : (data1) 7
-    <24d>   DW_AT_decl_line   : (data1) 156
-    <24e>   DW_AT_sibling     : (ref4) <0x277>
- <2><252>: Abbrev Number: 9 (DW_TAG_member)
-    <253>   DW_AT_name        : (strp) (offset: 0x15ce): _next
-    <257>   DW_AT_decl_file   : (data1) 7
-    <258>   DW_AT_decl_line   : (data1) 157
-    <259>   DW_AT_type        : (ref4) <0x277>, _IO_marker
-    <25d>   DW_AT_data_member_location: (data1) 0
- <2><25e>: Abbrev Number: 9 (DW_TAG_member)
-    <25f>   DW_AT_name        : (strp) (offset: 0x193b): _sbuf
-    <263>   DW_AT_decl_file   : (data1) 7
-    <264>   DW_AT_decl_line   : (data1) 158
-    <265>   DW_AT_type        : (ref4) <0x27d>, _IO_FILE
-    <269>   DW_AT_data_member_location: (data1) 8
- <2><26a>: Abbrev Number: 9 (DW_TAG_member)
-    <26b>   DW_AT_name        : (strp) (offset: 0x24a0): _pos
-    <26f>   DW_AT_decl_file   : (data1) 7
-    <270>   DW_AT_decl_line   : (data1) 162
-    <271>   DW_AT_type        : (ref4) <0x68>, int
-    <275>   DW_AT_data_member_location: (data1) 16
- <2><276>: Abbrev Number: 0
- <1><277>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <278>   DW_AT_byte_size   : (data1) 8
-    <279>   DW_AT_type        : (ref4) <0x246>, _IO_marker
- <1><27d>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <27e>   DW_AT_byte_size   : (data1) 8
-    <27f>   DW_AT_type        : (ref4) <0xc2>, _IO_FILE
- <1><283>: Abbrev Number: 12 (DW_TAG_array_type)
-    <284>   DW_AT_type        : (ref4) <0xab>, char
-    <288>   DW_AT_sibling     : (ref4) <0x293>
- <2><28c>: Abbrev Number: 13 (DW_TAG_subrange_type)
-    <28d>   DW_AT_type        : (ref4) <0x91>, sizetype
-    <291>   DW_AT_upper_bound : (data1) 0
- <2><292>: Abbrev Number: 0
- <1><293>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <294>   DW_AT_byte_size   : (data1) 8
-    <295>   DW_AT_type        : (ref4) <0x23f>, _IO_lock_t
- <1><299>: Abbrev Number: 12 (DW_TAG_array_type)
-    <29a>   DW_AT_type        : (ref4) <0xab>, char
-    <29e>   DW_AT_sibling     : (ref4) <0x2a9>
- <2><2a2>: Abbrev Number: 13 (DW_TAG_subrange_type)
-    <2a3>   DW_AT_type        : (ref4) <0x91>, sizetype
-    <2a7>   DW_AT_upper_bound : (data1) 19
- <2><2a8>: Abbrev Number: 0
- <1><2a9>: Abbrev Number: 14 (DW_TAG_structure_type)
-    <2aa>   DW_AT_name        : (strp) (offset: 0x4bc): _IO_FILE_plus
-    <2ae>   DW_AT_declaration : (flag_present) 1
- <1><2ae>: Abbrev Number: 15 (DW_TAG_variable)
-    <2af>   DW_AT_name        : (strp) (offset: 0x2308): _IO_2_1_stdin_
-    <2b3>   DW_AT_decl_file   : (data1) 7
-    <2b4>   DW_AT_decl_line   : (data2) 315
-    <2b6>   DW_AT_type        : (ref4) <0x2a9>, _IO_FILE_plus
-    <2ba>   DW_AT_external    : (flag_present) 1
-    <2ba>   DW_AT_declaration : (flag_present) 1
- <1><2ba>: Abbrev Number: 15 (DW_TAG_variable)
-    <2bb>   DW_AT_name        : (strp) (offset: 0x1f3c): _IO_2_1_stdout_
-    <2bf>   DW_AT_decl_file   : (data1) 7
-    <2c0>   DW_AT_decl_line   : (data2) 316
-    <2c2>   DW_AT_type        : (ref4) <0x2a9>, _IO_FILE_plus
-    <2c6>   DW_AT_external    : (flag_present) 1
-    <2c6>   DW_AT_declaration : (flag_present) 1
- <1><2c6>: Abbrev Number: 15 (DW_TAG_variable)
-    <2c7>   DW_AT_name        : (strp) (offset: 0x18da): _IO_2_1_stderr_
-    <2cb>   DW_AT_decl_file   : (data1) 7
-    <2cc>   DW_AT_decl_line   : (data2) 317
-    <2ce>   DW_AT_type        : (ref4) <0x2a9>, _IO_FILE_plus
-    <2d2>   DW_AT_external    : (flag_present) 1
-    <2d2>   DW_AT_declaration : (flag_present) 1
- <1><2d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <2d3>   DW_AT_byte_size   : (data1) 8
-    <2d4>   DW_AT_type        : (ref4) <0xb2>, char
- <1><2d8>: Abbrev Number: 4 (DW_TAG_const_type)
-    <2d9>   DW_AT_type        : (ref4) <0x2d2>, char
- <1><2dd>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2de>   DW_AT_name        : (strp) (offset: 0x16d8): ssize_t
-    <2e2>   DW_AT_decl_file   : (data1) 6
-    <2e3>   DW_AT_decl_line   : (data1) 104
-    <2e4>   DW_AT_type        : (ref4) <0x9a>, __ssize_t, long int
- <1><2e8>: Abbrev Number: 16 (DW_TAG_variable)
-    <2e9>   DW_AT_name        : (strp) (offset: 0x2140): stdin
-    <2ed>   DW_AT_decl_file   : (data1) 6
-    <2ee>   DW_AT_decl_line   : (data1) 170
-    <2ef>   DW_AT_type        : (ref4) <0x27d>, _IO_FILE
-    <2f3>   DW_AT_external    : (flag_present) 1
-    <2f3>   DW_AT_declaration : (flag_present) 1
- <1><2f3>: Abbrev Number: 16 (DW_TAG_variable)
-    <2f4>   DW_AT_name        : (strp) (offset: 0x19c1): stdout
-    <2f8>   DW_AT_decl_file   : (data1) 6
-    <2f9>   DW_AT_decl_line   : (data1) 171
-    <2fa>   DW_AT_type        : (ref4) <0x27d>, _IO_FILE
-    <2fe>   DW_AT_external    : (flag_present) 1
-    <2fe>   DW_AT_declaration : (flag_present) 1
- <1><2fe>: Abbrev Number: 16 (DW_TAG_variable)
-    <2ff>   DW_AT_name        : (strp) (offset: 0x18ea): stderr
-    <303>   DW_AT_decl_file   : (data1) 6
-    <304>   DW_AT_decl_line   : (data1) 172
-    <305>   DW_AT_type        : (ref4) <0x27d>, _IO_FILE
-    <309>   DW_AT_external    : (flag_present) 1
-    <309>   DW_AT_declaration : (flag_present) 1
- <1><309>: Abbrev Number: 16 (DW_TAG_variable)
-    <30a>   DW_AT_name        : (strp) (offset: 0x2b0a): sys_nerr
-    <30e>   DW_AT_decl_file   : (data1) 8
-    <30f>   DW_AT_decl_line   : (data1) 26
-    <310>   DW_AT_type        : (ref4) <0x68>, int
-    <314>   DW_AT_external    : (flag_present) 1
-    <314>   DW_AT_declaration : (flag_present) 1
- <1><314>: Abbrev Number: 12 (DW_TAG_array_type)
-    <315>   DW_AT_type        : (ref4) <0x2d8>, char
-    <319>   DW_AT_sibling     : (ref4) <0x31f>
- <2><31d>: Abbrev Number: 17 (DW_TAG_subrange_type)
- <2><31e>: Abbrev Number: 0
- <1><31f>: Abbrev Number: 4 (DW_TAG_const_type)
-    <320>   DW_AT_type        : (ref4) <0x314>, char
- <1><324>: Abbrev Number: 16 (DW_TAG_variable)
-    <325>   DW_AT_name        : (strp) (offset: 0x41): sys_errlist
-    <329>   DW_AT_decl_file   : (data1) 8
-    <32a>   DW_AT_decl_line   : (data1) 27
-    <32b>   DW_AT_type        : (ref4) <0x31f>, char
-    <32f>   DW_AT_external    : (flag_present) 1
-    <32f>   DW_AT_declaration : (flag_present) 1
- <1><32f>: Abbrev Number: 16 (DW_TAG_variable)
-    <330>   DW_AT_name        : (strp) (offset: 0x2b09): _sys_nerr
-    <334>   DW_AT_decl_file   : (data1) 8
-    <335>   DW_AT_decl_line   : (data1) 30
-    <336>   DW_AT_type        : (ref4) <0x68>, int
-    <33a>   DW_AT_external    : (flag_present) 1
-    <33a>   DW_AT_declaration : (flag_present) 1
- <1><33a>: Abbrev Number: 16 (DW_TAG_variable)
-    <33b>   DW_AT_name        : (strp) (offset: 0x40): _sys_errlist
-    <33f>   DW_AT_decl_file   : (data1) 8
-    <340>   DW_AT_decl_line   : (data1) 31
-    <341>   DW_AT_type        : (ref4) <0x31f>, char
-    <345>   DW_AT_external    : (flag_present) 1
-    <345>   DW_AT_declaration : (flag_present) 1
- <1><345>: Abbrev Number: 16 (DW_TAG_variable)
-    <346>   DW_AT_name        : (strp) (offset: 0x279d): program_invocation_name
-    <34a>   DW_AT_decl_file   : (data1) 9
-    <34b>   DW_AT_decl_line   : (data1) 54
-    <34c>   DW_AT_type        : (ref4) <0xa5>, char
-    <350>   DW_AT_external    : (flag_present) 1
-    <350>   DW_AT_declaration : (flag_present) 1
- <1><350>: Abbrev Number: 16 (DW_TAG_variable)
-    <351>   DW_AT_name        : (strp) (offset: 0x10f6): program_invocation_short_name
-    <355>   DW_AT_decl_file   : (data1) 9
-    <356>   DW_AT_decl_line   : (data1) 54
-    <357>   DW_AT_type        : (ref4) <0xa5>, char
-    <35b>   DW_AT_external    : (flag_present) 1
-    <35b>   DW_AT_declaration : (flag_present) 1
- <1><35b>: Abbrev Number: 18 (DW_TAG_typedef)
-    <35c>   DW_AT_name        : (strp) (offset: 0x1b8e): wchar_t
-    <360>   DW_AT_decl_file   : (data1) 4
-    <361>   DW_AT_decl_line   : (data2) 328
-    <363>   DW_AT_type        : (ref4) <0x68>, int
- <1><367>: Abbrev Number: 3 (DW_TAG_base_type)
-    <368>   DW_AT_byte_size   : (data1) 8
-    <369>   DW_AT_encoding    : (data1) 5	(signed)
-    <36a>   DW_AT_name        : (strp) (offset: 0x2c88): long long int
- <1><36e>: Abbrev Number: 2 (DW_TAG_typedef)
-    <36f>   DW_AT_name        : (strp) (offset: 0x1f21): int32_t
-    <373>   DW_AT_decl_file   : (data1) 10
-    <374>   DW_AT_decl_line   : (data1) 196
-    <375>   DW_AT_type        : (ref4) <0x68>, int
- <1><379>: Abbrev Number: 2 (DW_TAG_typedef)
-    <37a>   DW_AT_name        : (strp) (offset: 0xe6b): int64_t
-    <37e>   DW_AT_decl_file   : (data1) 10
-    <37f>   DW_AT_decl_line   : (data1) 197
-    <380>   DW_AT_type        : (ref4) <0x74>, long int
- <1><384>: Abbrev Number: 3 (DW_TAG_base_type)
-    <385>   DW_AT_byte_size   : (data1) 8
-    <386>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <387>   DW_AT_name        : (strp) (offset: 0x28d0): long long unsigned int
- <1><38b>: Abbrev Number: 15 (DW_TAG_variable)
-    <38c>   DW_AT_name        : (strp) (offset: 0x31a): __environ
-    <390>   DW_AT_decl_file   : (data1) 11
-    <391>   DW_AT_decl_line   : (data2) 546
-    <393>   DW_AT_type        : (ref4) <0x397>, char
-    <397>   DW_AT_external    : (flag_present) 1
-    <397>   DW_AT_declaration : (flag_present) 1
- <1><397>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <398>   DW_AT_byte_size   : (data1) 8
-    <399>   DW_AT_type        : (ref4) <0xa5>, char
- <1><39d>: Abbrev Number: 15 (DW_TAG_variable)
-    <39e>   DW_AT_name        : (strp) (offset: 0x31c): environ
-    <3a2>   DW_AT_decl_file   : (data1) 11
-    <3a3>   DW_AT_decl_line   : (data2) 548
-    <3a5>   DW_AT_type        : (ref4) <0x397>, char
-    <3a9>   DW_AT_external    : (flag_present) 1
-    <3a9>   DW_AT_declaration : (flag_present) 1
- <1><3a9>: Abbrev Number: 16 (DW_TAG_variable)
-    <3aa>   DW_AT_name        : (strp) (offset: 0x9db): optarg
-    <3ae>   DW_AT_decl_file   : (data1) 12
-    <3af>   DW_AT_decl_line   : (data1) 57
-    <3b0>   DW_AT_type        : (ref4) <0xa5>, char
-    <3b4>   DW_AT_external    : (flag_present) 1
-    <3b4>   DW_AT_declaration : (flag_present) 1
- <1><3b4>: Abbrev Number: 16 (DW_TAG_variable)
-    <3b5>   DW_AT_name        : (strp) (offset: 0x2c39): optind
-    <3b9>   DW_AT_decl_file   : (data1) 12
-    <3ba>   DW_AT_decl_line   : (data1) 71
-    <3bb>   DW_AT_type        : (ref4) <0x68>, int
-    <3bf>   DW_AT_external    : (flag_present) 1
-    <3bf>   DW_AT_declaration : (flag_present) 1
- <1><3bf>: Abbrev Number: 16 (DW_TAG_variable)
-    <3c0>   DW_AT_name        : (strp) (offset: 0x1c3f): opterr
-    <3c4>   DW_AT_decl_file   : (data1) 12
-    <3c5>   DW_AT_decl_line   : (data1) 76
-    <3c6>   DW_AT_type        : (ref4) <0x68>, int
-    <3ca>   DW_AT_external    : (flag_present) 1
-    <3ca>   DW_AT_declaration : (flag_present) 1
- <1><3ca>: Abbrev Number: 16 (DW_TAG_variable)
-    <3cb>   DW_AT_name        : (strp) (offset: 0x19ea): optopt
-    <3cf>   DW_AT_decl_file   : (data1) 12
-    <3d0>   DW_AT_decl_line   : (data1) 80
-    <3d1>   DW_AT_type        : (ref4) <0x68>, int
-    <3d5>   DW_AT_external    : (flag_present) 1
-    <3d5>   DW_AT_declaration : (flag_present) 1
- <1><3d5>: Abbrev Number: 2 (DW_TAG_typedef)
-    <3d6>   DW_AT_name        : (strp) (offset: 0x1f20): uint32_t
-    <3da>   DW_AT_decl_file   : (data1) 13
-    <3db>   DW_AT_decl_line   : (data1) 51
-    <3dc>   DW_AT_type        : (ref4) <0x4e>, unsigned int
- <1><3e0>: Abbrev Number: 2 (DW_TAG_typedef)
-    <3e1>   DW_AT_name        : (strp) (offset: 0xe6a): uint64_t
-    <3e5>   DW_AT_decl_file   : (data1) 13
-    <3e6>   DW_AT_decl_line   : (data1) 55
-    <3e7>   DW_AT_type        : (ref4) <0x34>, long unsigned int
- <1><3eb>: Abbrev Number: 2 (DW_TAG_typedef)
-    <3ec>   DW_AT_name        : (strp) (offset: 0x2b52): Py_ssize_t
-    <3f0>   DW_AT_decl_file   : (data1) 14
-    <3f1>   DW_AT_decl_line   : (data1) 105
-    <3f2>   DW_AT_type        : (ref4) <0x2dd>, ssize_t, __ssize_t, long int
- <1><3f6>: Abbrev Number: 4 (DW_TAG_const_type)
-    <3f7>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><91>: Abbrev Number: 6 (DW_TAG_array_type)
+    <92>   DW_AT_type        : (ref4) <0x68>, int
+    <96>   DW_AT_sibling     : (ref4) <0xa1>
+ <2><9a>: Abbrev Number: 7 (DW_TAG_subrange_type)
+    <9b>   DW_AT_type        : (ref4) <0xa1>, sizetype
+    <9f>   DW_AT_upper_bound : (data1) 1
+ <2><a0>: Abbrev Number: 0
+ <1><a1>: Abbrev Number: 3 (DW_TAG_base_type)
+    <a2>   DW_AT_byte_size   : (data1) 8
+    <a3>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <a4>   DW_AT_name        : (strp) (offset: 0x1b8f): sizetype
+ <1><a8>: Abbrev Number: 8 (DW_TAG_pointer_type)
+    <a9>   DW_AT_byte_size   : (data1) 8
+ <1><aa>: Abbrev Number: 2 (DW_TAG_typedef)
+    <ab>   DW_AT_name        : (strp) (offset: 0x17ea): __ssize_t
+    <af>   DW_AT_decl_file   : (data1) 5
+    <b0>   DW_AT_decl_line   : (data1) 172
+    <b1>   DW_AT_type        : (ref4) <0x74>, long int
+ <1><b5>: Abbrev Number: 9 (DW_TAG_pointer_type)
+    <b6>   DW_AT_byte_size   : (data1) 8
+    <b7>   DW_AT_type        : (ref4) <0xbb>, char
+ <1><bb>: Abbrev Number: 3 (DW_TAG_base_type)
+    <bc>   DW_AT_byte_size   : (data1) 1
+    <bd>   DW_AT_encoding    : (data1) 6	(signed char)
+    <be>   DW_AT_name        : (strp) (offset: 0xd1f): char
+ <1><c2>: Abbrev Number: 4 (DW_TAG_const_type)
+    <c3>   DW_AT_type        : (ref4) <0xbb>, char
+ <1><c7>: Abbrev Number: 2 (DW_TAG_typedef)
+    <c8>   DW_AT_name        : (strp) (offset: 0x23ef): FILE
+    <cc>   DW_AT_decl_file   : (data1) 6
+    <cd>   DW_AT_decl_line   : (data1) 48
+    <ce>   DW_AT_type        : (ref4) <0xd2>, _IO_FILE
+ <1><d2>: Abbrev Number: 10 (DW_TAG_structure_type)
+    <d3>   DW_AT_name        : (strp) (offset: 0x23eb): _IO_FILE
+    <d7>   DW_AT_byte_size   : (data1) 216
+    <d8>   DW_AT_decl_file   : (data1) 7
+    <d9>   DW_AT_decl_line   : (data1) 241
+    <da>   DW_AT_sibling     : (ref4) <0x24f>
+ <2><de>: Abbrev Number: 11 (DW_TAG_member)
+    <df>   DW_AT_name        : (strp) (offset: 0x1919): _flags
+    <e3>   DW_AT_decl_file   : (data1) 7
+    <e4>   DW_AT_decl_line   : (data1) 242
+    <e5>   DW_AT_type        : (ref4) <0x68>, int
+    <e9>   DW_AT_data_member_location: (data1) 0
+ <2><ea>: Abbrev Number: 11 (DW_TAG_member)
+    <eb>   DW_AT_name        : (strp) (offset: 0x2c56): _IO_read_ptr
+    <ef>   DW_AT_decl_file   : (data1) 7
+    <f0>   DW_AT_decl_line   : (data1) 247
+    <f1>   DW_AT_type        : (ref4) <0xb5>, char
+    <f5>   DW_AT_data_member_location: (data1) 8
+ <2><f6>: Abbrev Number: 11 (DW_TAG_member)
+    <f7>   DW_AT_name        : (strp) (offset: 0x2397): _IO_read_end
+    <fb>   DW_AT_decl_file   : (data1) 7
+    <fc>   DW_AT_decl_line   : (data1) 248
+    <fd>   DW_AT_type        : (ref4) <0xb5>, char
+    <101>   DW_AT_data_member_location: (data1) 16
+ <2><102>: Abbrev Number: 11 (DW_TAG_member)
+    <103>   DW_AT_name        : (strp) (offset: 0x1ccc): _IO_read_base
+    <107>   DW_AT_decl_file   : (data1) 7
+    <108>   DW_AT_decl_line   : (data1) 249
+    <109>   DW_AT_type        : (ref4) <0xb5>, char
+    <10d>   DW_AT_data_member_location: (data1) 24
+ <2><10e>: Abbrev Number: 11 (DW_TAG_member)
+    <10f>   DW_AT_name        : (strp) (offset: 0x1e04): _IO_write_base
+    <113>   DW_AT_decl_file   : (data1) 7
+    <114>   DW_AT_decl_line   : (data1) 250
+    <115>   DW_AT_type        : (ref4) <0xb5>, char
+    <119>   DW_AT_data_member_location: (data1) 32
+ <2><11a>: Abbrev Number: 11 (DW_TAG_member)
+    <11b>   DW_AT_name        : (strp) (offset: 0x1100): _IO_write_ptr
+    <11f>   DW_AT_decl_file   : (data1) 7
+    <120>   DW_AT_decl_line   : (data1) 251
+    <121>   DW_AT_type        : (ref4) <0xb5>, char
+    <125>   DW_AT_data_member_location: (data1) 40
+ <2><126>: Abbrev Number: 11 (DW_TAG_member)
+    <127>   DW_AT_name        : (strp) (offset: 0x7a4): _IO_write_end
+    <12b>   DW_AT_decl_file   : (data1) 7
+    <12c>   DW_AT_decl_line   : (data1) 252
+    <12d>   DW_AT_type        : (ref4) <0xb5>, char
+    <131>   DW_AT_data_member_location: (data1) 48
+ <2><132>: Abbrev Number: 11 (DW_TAG_member)
+    <133>   DW_AT_name        : (strp) (offset: 0x22d6): _IO_buf_base
+    <137>   DW_AT_decl_file   : (data1) 7
+    <138>   DW_AT_decl_line   : (data1) 253
+    <139>   DW_AT_type        : (ref4) <0xb5>, char
+    <13d>   DW_AT_data_member_location: (data1) 56
+ <2><13e>: Abbrev Number: 11 (DW_TAG_member)
+    <13f>   DW_AT_name        : (strp) (offset: 0x1d23): _IO_buf_end
+    <143>   DW_AT_decl_file   : (data1) 7
+    <144>   DW_AT_decl_line   : (data1) 254
+    <145>   DW_AT_type        : (ref4) <0xb5>, char
+    <149>   DW_AT_data_member_location: (data1) 64
+ <2><14a>: Abbrev Number: 12 (DW_TAG_member)
+    <14b>   DW_AT_name        : (strp) (offset: 0x14b3): _IO_save_base
+    <14f>   DW_AT_decl_file   : (data1) 7
+    <150>   DW_AT_decl_line   : (data2) 256
+    <152>   DW_AT_type        : (ref4) <0xb5>, char
+    <156>   DW_AT_data_member_location: (data1) 72
+ <2><157>: Abbrev Number: 12 (DW_TAG_member)
+    <158>   DW_AT_name        : (strp) (offset: 0x2c46): _IO_backup_base
+    <15c>   DW_AT_decl_file   : (data1) 7
+    <15d>   DW_AT_decl_line   : (data2) 257
+    <15f>   DW_AT_type        : (ref4) <0xb5>, char
+    <163>   DW_AT_data_member_location: (data1) 80
+ <2><164>: Abbrev Number: 12 (DW_TAG_member)
+    <165>   DW_AT_name        : (strp) (offset: 0x1a6d): _IO_save_end
+    <169>   DW_AT_decl_file   : (data1) 7
+    <16a>   DW_AT_decl_line   : (data2) 258
+    <16c>   DW_AT_type        : (ref4) <0xb5>, char
+    <170>   DW_AT_data_member_location: (data1) 88
+ <2><171>: Abbrev Number: 12 (DW_TAG_member)
+    <172>   DW_AT_name        : (strp) (offset: 0x265a): _markers
+    <176>   DW_AT_decl_file   : (data1) 7
+    <177>   DW_AT_decl_line   : (data2) 260
+    <179>   DW_AT_type        : (ref4) <0x287>, _IO_marker
+    <17d>   DW_AT_data_member_location: (data1) 96
+ <2><17e>: Abbrev Number: 12 (DW_TAG_member)
+    <17f>   DW_AT_name        : (strp) (offset: 0xc92): _chain
+    <183>   DW_AT_decl_file   : (data1) 7
+    <184>   DW_AT_decl_line   : (data2) 262
+    <186>   DW_AT_type        : (ref4) <0x28d>, _IO_FILE
+    <18a>   DW_AT_data_member_location: (data1) 104
+ <2><18b>: Abbrev Number: 12 (DW_TAG_member)
+    <18c>   DW_AT_name        : (strp) (offset: 0x7d): _fileno
+    <190>   DW_AT_decl_file   : (data1) 7
+    <191>   DW_AT_decl_line   : (data2) 264
+    <193>   DW_AT_type        : (ref4) <0x68>, int
+    <197>   DW_AT_data_member_location: (data1) 112
+ <2><198>: Abbrev Number: 12 (DW_TAG_member)
+    <199>   DW_AT_name        : (strp) (offset: 0x2f42): _flags2
+    <19d>   DW_AT_decl_file   : (data1) 7
+    <19e>   DW_AT_decl_line   : (data2) 268
+    <1a0>   DW_AT_type        : (ref4) <0x68>, int
+    <1a4>   DW_AT_data_member_location: (data1) 116
+ <2><1a5>: Abbrev Number: 12 (DW_TAG_member)
+    <1a6>   DW_AT_name        : (strp) (offset: 0x2dd4): _old_offset
+    <1aa>   DW_AT_decl_file   : (data1) 7
+    <1ab>   DW_AT_decl_line   : (data2) 270
+    <1ad>   DW_AT_type        : (ref4) <0x7b>, __off_t, long int
+    <1b1>   DW_AT_data_member_location: (data1) 120
+ <2><1b2>: Abbrev Number: 12 (DW_TAG_member)
+    <1b3>   DW_AT_name        : (strp) (offset: 0x2b36): _cur_column
+    <1b7>   DW_AT_decl_file   : (data1) 7
+    <1b8>   DW_AT_decl_line   : (data2) 274
+    <1ba>   DW_AT_type        : (ref4) <0x47>, short unsigned int
+    <1be>   DW_AT_data_member_location: (data1) 128
+ <2><1bf>: Abbrev Number: 12 (DW_TAG_member)
+    <1c0>   DW_AT_name        : (strp) (offset: 0x3356): _vtable_offset
+    <1c4>   DW_AT_decl_file   : (data1) 7
+    <1c5>   DW_AT_decl_line   : (data2) 275
+    <1c7>   DW_AT_type        : (ref4) <0x5a>, signed char
+    <1cb>   DW_AT_data_member_location: (data1) 130
+ <2><1cc>: Abbrev Number: 12 (DW_TAG_member)
+    <1cd>   DW_AT_name        : (strp) (offset: 0x2a6): _shortbuf
+    <1d1>   DW_AT_decl_file   : (data1) 7
+    <1d2>   DW_AT_decl_line   : (data2) 276
+    <1d4>   DW_AT_type        : (ref4) <0x293>, char
+    <1d8>   DW_AT_data_member_location: (data1) 131
+ <2><1d9>: Abbrev Number: 12 (DW_TAG_member)
+    <1da>   DW_AT_name        : (strp) (offset: 0x50a): _lock
+    <1de>   DW_AT_decl_file   : (data1) 7
+    <1df>   DW_AT_decl_line   : (data2) 280
+    <1e1>   DW_AT_type        : (ref4) <0x2a3>, _IO_lock_t
+    <1e5>   DW_AT_data_member_location: (data1) 136
+ <2><1e6>: Abbrev Number: 12 (DW_TAG_member)
+    <1e7>   DW_AT_name        : (strp) (offset: 0x2dd8): _offset
+    <1eb>   DW_AT_decl_file   : (data1) 7
+    <1ec>   DW_AT_decl_line   : (data2) 289
+    <1ee>   DW_AT_type        : (ref4) <0x86>, __off64_t, long int
+    <1f2>   DW_AT_data_member_location: (data1) 144
+ <2><1f3>: Abbrev Number: 12 (DW_TAG_member)
+    <1f4>   DW_AT_name        : (strp) (offset: 0x25f6): __pad1
+    <1f8>   DW_AT_decl_file   : (data1) 7
+    <1f9>   DW_AT_decl_line   : (data2) 297
+    <1fb>   DW_AT_type        : (ref4) <0xa8>
+    <1ff>   DW_AT_data_member_location: (data1) 152
+ <2><200>: Abbrev Number: 12 (DW_TAG_member)
+    <201>   DW_AT_name        : (strp) (offset: 0x15c8): __pad2
+    <205>   DW_AT_decl_file   : (data1) 7
+    <206>   DW_AT_decl_line   : (data2) 298
+    <208>   DW_AT_type        : (ref4) <0xa8>
+    <20c>   DW_AT_data_member_location: (data1) 160
+ <2><20d>: Abbrev Number: 12 (DW_TAG_member)
+    <20e>   DW_AT_name        : (strp) (offset: 0x25fd): __pad3
+    <212>   DW_AT_decl_file   : (data1) 7
+    <213>   DW_AT_decl_line   : (data2) 299
+    <215>   DW_AT_type        : (ref4) <0xa8>
+    <219>   DW_AT_data_member_location: (data1) 168
+ <2><21a>: Abbrev Number: 12 (DW_TAG_member)
+    <21b>   DW_AT_name        : (strp) (offset: 0x2604): __pad4
+    <21f>   DW_AT_decl_file   : (data1) 7
+    <220>   DW_AT_decl_line   : (data2) 300
+    <222>   DW_AT_type        : (ref4) <0xa8>
+    <226>   DW_AT_data_member_location: (data1) 176
+ <2><227>: Abbrev Number: 12 (DW_TAG_member)
+    <228>   DW_AT_name        : (strp) (offset: 0x260b): __pad5
+    <22c>   DW_AT_decl_file   : (data1) 7
+    <22d>   DW_AT_decl_line   : (data2) 302
+    <22f>   DW_AT_type        : (ref4) <0x29>, size_t, long unsigned int
+    <233>   DW_AT_data_member_location: (data1) 184
+ <2><234>: Abbrev Number: 12 (DW_TAG_member)
+    <235>   DW_AT_name        : (strp) (offset: 0x1dca): _mode
+    <239>   DW_AT_decl_file   : (data1) 7
+    <23a>   DW_AT_decl_line   : (data2) 303
+    <23c>   DW_AT_type        : (ref4) <0x68>, int
+    <240>   DW_AT_data_member_location: (data1) 192
+ <2><241>: Abbrev Number: 12 (DW_TAG_member)
+    <242>   DW_AT_name        : (strp) (offset: 0x62): _unused2
+    <246>   DW_AT_decl_file   : (data1) 7
+    <247>   DW_AT_decl_line   : (data2) 305
+    <249>   DW_AT_type        : (ref4) <0x2a9>, char
+    <24d>   DW_AT_data_member_location: (data1) 196
+ <2><24e>: Abbrev Number: 0
+ <1><24f>: Abbrev Number: 13 (DW_TAG_typedef)
+    <250>   DW_AT_name        : (strp) (offset: 0xda7): _IO_lock_t
+    <254>   DW_AT_decl_file   : (data1) 7
+    <255>   DW_AT_decl_line   : (data1) 150
+ <1><256>: Abbrev Number: 10 (DW_TAG_structure_type)
+    <257>   DW_AT_name        : (strp) (offset: 0x1f38): _IO_marker
+    <25b>   DW_AT_byte_size   : (data1) 24
+    <25c>   DW_AT_decl_file   : (data1) 7
+    <25d>   DW_AT_decl_line   : (data1) 156
+    <25e>   DW_AT_sibling     : (ref4) <0x287>
+ <2><262>: Abbrev Number: 11 (DW_TAG_member)
+    <263>   DW_AT_name        : (strp) (offset: 0x16c2): _next
+    <267>   DW_AT_decl_file   : (data1) 7
+    <268>   DW_AT_decl_line   : (data1) 157
+    <269>   DW_AT_type        : (ref4) <0x287>, _IO_marker
+    <26d>   DW_AT_data_member_location: (data1) 0
+ <2><26e>: Abbrev Number: 11 (DW_TAG_member)
+    <26f>   DW_AT_name        : (strp) (offset: 0x1a55): _sbuf
+    <273>   DW_AT_decl_file   : (data1) 7
+    <274>   DW_AT_decl_line   : (data1) 158
+    <275>   DW_AT_type        : (ref4) <0x28d>, _IO_FILE
+    <279>   DW_AT_data_member_location: (data1) 8
+ <2><27a>: Abbrev Number: 11 (DW_TAG_member)
+    <27b>   DW_AT_name        : (strp) (offset: 0x2663): _pos
+    <27f>   DW_AT_decl_file   : (data1) 7
+    <280>   DW_AT_decl_line   : (data1) 162
+    <281>   DW_AT_type        : (ref4) <0x68>, int
+    <285>   DW_AT_data_member_location: (data1) 16
+ <2><286>: Abbrev Number: 0
+ <1><287>: Abbrev Number: 9 (DW_TAG_pointer_type)
+    <288>   DW_AT_byte_size   : (data1) 8
+    <289>   DW_AT_type        : (ref4) <0x256>, _IO_marker
+ <1><28d>: Abbrev Number: 9 (DW_TAG_pointer_type)
+    <28e>   DW_AT_byte_size   : (data1) 8
+    <28f>   DW_AT_type        : (ref4) <0xd2>, _IO_FILE
+ <1><293>: Abbrev Number: 6 (DW_TAG_array_type)
+    <294>   DW_AT_type        : (ref4) <0xbb>, char
+    <298>   DW_AT_sibling     : (ref4) <0x2a3>
+ <2><29c>: Abbrev Number: 7 (DW_TAG_subrange_type)
+    <29d>   DW_AT_type        : (ref4) <0xa1>, sizetype
+    <2a1>   DW_AT_upper_bound : (data1) 0
+ <2><2a2>: Abbrev Number: 0
+ <1><2a3>: Abbrev Number: 9 (DW_TAG_pointer_type)
+    <2a4>   DW_AT_byte_size   : (data1) 8
+    <2a5>   DW_AT_type        : (ref4) <0x24f>, _IO_lock_t
+ <1><2a9>: Abbrev Number: 6 (DW_TAG_array_type)
+    <2aa>   DW_AT_type        : (ref4) <0xbb>, char
+    <2ae>   DW_AT_sibling     : (ref4) <0x2b9>
+ <2><2b2>: Abbrev Number: 7 (DW_TAG_subrange_type)
+    <2b3>   DW_AT_type        : (ref4) <0xa1>, sizetype
+    <2b7>   DW_AT_upper_bound : (data1) 19
+ <2><2b8>: Abbrev Number: 0
+ <1><2b9>: Abbrev Number: 14 (DW_TAG_structure_type)
+    <2ba>   DW_AT_name        : (strp) (offset: 0x4fc): _IO_FILE_plus
+    <2be>   DW_AT_declaration : (flag_present) 1
+ <1><2be>: Abbrev Number: 15 (DW_TAG_variable)
+    <2bf>   DW_AT_name        : (strp) (offset: 0x24c0): _IO_2_1_stdin_
+    <2c3>   DW_AT_decl_file   : (data1) 7
+    <2c4>   DW_AT_decl_line   : (data2) 315
+    <2c6>   DW_AT_type        : (ref4) <0x2b9>, _IO_FILE_plus
+    <2ca>   DW_AT_external    : (flag_present) 1
+    <2ca>   DW_AT_declaration : (flag_present) 1
+ <1><2ca>: Abbrev Number: 15 (DW_TAG_variable)
+    <2cb>   DW_AT_name        : (strp) (offset: 0x2087): _IO_2_1_stdout_
+    <2cf>   DW_AT_decl_file   : (data1) 7
+    <2d0>   DW_AT_decl_line   : (data2) 316
+    <2d2>   DW_AT_type        : (ref4) <0x2b9>, _IO_FILE_plus
+    <2d6>   DW_AT_external    : (flag_present) 1
+    <2d6>   DW_AT_declaration : (flag_present) 1
+ <1><2d6>: Abbrev Number: 15 (DW_TAG_variable)
+    <2d7>   DW_AT_name        : (strp) (offset: 0x19fb): _IO_2_1_stderr_
+    <2db>   DW_AT_decl_file   : (data1) 7
+    <2dc>   DW_AT_decl_line   : (data2) 317
+    <2de>   DW_AT_type        : (ref4) <0x2b9>, _IO_FILE_plus
+    <2e2>   DW_AT_external    : (flag_present) 1
+    <2e2>   DW_AT_declaration : (flag_present) 1
+ <1><2e2>: Abbrev Number: 9 (DW_TAG_pointer_type)
+    <2e3>   DW_AT_byte_size   : (data1) 8
+    <2e4>   DW_AT_type        : (ref4) <0xc2>, char
+ <1><2e8>: Abbrev Number: 4 (DW_TAG_const_type)
+    <2e9>   DW_AT_type        : (ref4) <0x2e2>, char
+ <1><2ed>: Abbrev Number: 2 (DW_TAG_typedef)
+    <2ee>   DW_AT_name        : (strp) (offset: 0x17ec): ssize_t
+    <2f2>   DW_AT_decl_file   : (data1) 6
+    <2f3>   DW_AT_decl_line   : (data1) 104
+    <2f4>   DW_AT_type        : (ref4) <0xaa>, __ssize_t, long int
+ <1><2f8>: Abbrev Number: 16 (DW_TAG_variable)
+    <2f9>   DW_AT_name        : (strp) (offset: 0x2296): stdin
+    <2fd>   DW_AT_decl_file   : (data1) 6
+    <2fe>   DW_AT_decl_line   : (data1) 170
+    <2ff>   DW_AT_type        : (ref4) <0x28d>, _IO_FILE
+    <303>   DW_AT_external    : (flag_present) 1
+    <303>   DW_AT_declaration : (flag_present) 1
+ <1><303>: Abbrev Number: 16 (DW_TAG_variable)
+    <304>   DW_AT_name        : (strp) (offset: 0x1adb): stdout
+    <308>   DW_AT_decl_file   : (data1) 6
+    <309>   DW_AT_decl_line   : (data1) 171
+    <30a>   DW_AT_type        : (ref4) <0x28d>, _IO_FILE
+    <30e>   DW_AT_external    : (flag_present) 1
+    <30e>   DW_AT_declaration : (flag_present) 1
+ <1><30e>: Abbrev Number: 16 (DW_TAG_variable)
+    <30f>   DW_AT_name        : (strp) (offset: 0x1a0b): stderr
+    <313>   DW_AT_decl_file   : (data1) 6
+    <314>   DW_AT_decl_line   : (data1) 172
+    <315>   DW_AT_type        : (ref4) <0x28d>, _IO_FILE
+    <319>   DW_AT_external    : (flag_present) 1
+    <319>   DW_AT_declaration : (flag_present) 1
+ <1><319>: Abbrev Number: 16 (DW_TAG_variable)
+    <31a>   DW_AT_name        : (strp) (offset: 0x2d64): sys_nerr
+    <31e>   DW_AT_decl_file   : (data1) 8
+    <31f>   DW_AT_decl_line   : (data1) 26
+    <320>   DW_AT_type        : (ref4) <0x68>, int
+    <324>   DW_AT_external    : (flag_present) 1
+    <324>   DW_AT_declaration : (flag_present) 1
+ <1><324>: Abbrev Number: 6 (DW_TAG_array_type)
+    <325>   DW_AT_type        : (ref4) <0x2e8>, char
+    <329>   DW_AT_sibling     : (ref4) <0x32f>
+ <2><32d>: Abbrev Number: 17 (DW_TAG_subrange_type)
+ <2><32e>: Abbrev Number: 0
+ <1><32f>: Abbrev Number: 4 (DW_TAG_const_type)
+    <330>   DW_AT_type        : (ref4) <0x324>, char
+ <1><334>: Abbrev Number: 16 (DW_TAG_variable)
+    <335>   DW_AT_name        : (strp) (offset: 0x41): sys_errlist
+    <339>   DW_AT_decl_file   : (data1) 8
+    <33a>   DW_AT_decl_line   : (data1) 27
+    <33b>   DW_AT_type        : (ref4) <0x32f>, char
+    <33f>   DW_AT_external    : (flag_present) 1
+    <33f>   DW_AT_declaration : (flag_present) 1
+ <1><33f>: Abbrev Number: 16 (DW_TAG_variable)
+    <340>   DW_AT_name        : (strp) (offset: 0x2d63): _sys_nerr
+    <344>   DW_AT_decl_file   : (data1) 8
+    <345>   DW_AT_decl_line   : (data1) 30
+    <346>   DW_AT_type        : (ref4) <0x68>, int
+    <34a>   DW_AT_external    : (flag_present) 1
+    <34a>   DW_AT_declaration : (flag_present) 1
+ <1><34a>: Abbrev Number: 16 (DW_TAG_variable)
+    <34b>   DW_AT_name        : (strp) (offset: 0x40): _sys_errlist
+    <34f>   DW_AT_decl_file   : (data1) 8
+    <350>   DW_AT_decl_line   : (data1) 31
+    <351>   DW_AT_type        : (ref4) <0x32f>, char
+    <355>   DW_AT_external    : (flag_present) 1
+    <355>   DW_AT_declaration : (flag_present) 1
+ <1><355>: Abbrev Number: 16 (DW_TAG_variable)
+    <356>   DW_AT_name        : (strp) (offset: 0x29ae): program_invocation_name
+    <35a>   DW_AT_decl_file   : (data1) 9
+    <35b>   DW_AT_decl_line   : (data1) 54
+    <35c>   DW_AT_type        : (ref4) <0xb5>, char
+    <360>   DW_AT_external    : (flag_present) 1
+    <360>   DW_AT_declaration : (flag_present) 1
+ <1><360>: Abbrev Number: 16 (DW_TAG_variable)
+    <361>   DW_AT_name        : (strp) (offset: 0x11be): program_invocation_short_name
+    <365>   DW_AT_decl_file   : (data1) 9
+    <366>   DW_AT_decl_line   : (data1) 54
+    <367>   DW_AT_type        : (ref4) <0xb5>, char
+    <36b>   DW_AT_external    : (flag_present) 1
+    <36b>   DW_AT_declaration : (flag_present) 1
+ <1><36b>: Abbrev Number: 18 (DW_TAG_typedef)
+    <36c>   DW_AT_name        : (strp) (offset: 0x1cb3): wchar_t
+    <370>   DW_AT_decl_file   : (data1) 4
+    <371>   DW_AT_decl_line   : (data2) 328
+    <373>   DW_AT_type        : (ref4) <0x68>, int
+ <1><377>: Abbrev Number: 3 (DW_TAG_base_type)
+    <378>   DW_AT_byte_size   : (data1) 8
+    <379>   DW_AT_encoding    : (data1) 5	(signed)
+    <37a>   DW_AT_name        : (strp) (offset: 0x2ee2): long long int
+ <1><37e>: Abbrev Number: 2 (DW_TAG_typedef)
+    <37f>   DW_AT_name        : (strp) (offset: 0x206c): int32_t
+    <383>   DW_AT_decl_file   : (data1) 10
+    <384>   DW_AT_decl_line   : (data1) 196
+    <385>   DW_AT_type        : (ref4) <0x68>, int
+ <1><389>: Abbrev Number: 2 (DW_TAG_typedef)
+    <38a>   DW_AT_name        : (strp) (offset: 0xf01): int64_t
+    <38e>   DW_AT_decl_file   : (data1) 10
+    <38f>   DW_AT_decl_line   : (data1) 197
+    <390>   DW_AT_type        : (ref4) <0x74>, long int
+ <1><394>: Abbrev Number: 3 (DW_TAG_base_type)
+    <395>   DW_AT_byte_size   : (data1) 8
+    <396>   DW_AT_encoding    : (data1) 7	(unsigned)
+    <397>   DW_AT_name        : (strp) (offset: 0x2b0f): long long unsigned int
+ <1><39b>: Abbrev Number: 15 (DW_TAG_variable)
+    <39c>   DW_AT_name        : (strp) (offset: 0x334): __environ
+    <3a0>   DW_AT_decl_file   : (data1) 11
+    <3a1>   DW_AT_decl_line   : (data2) 546
+    <3a3>   DW_AT_type        : (ref4) <0x3a7>, char
+    <3a7>   DW_AT_external    : (flag_present) 1
+    <3a7>   DW_AT_declaration : (flag_present) 1
+ <1><3a7>: Abbrev Number: 9 (DW_TAG_pointer_type)
+    <3a8>   DW_AT_byte_size   : (data1) 8
+    <3a9>   DW_AT_type        : (ref4) <0xb5>, char
+ <1><3ad>: Abbrev Number: 15 (DW_TAG_variable)
+    <3ae>   DW_AT_name        : (strp) (offset: 0x336): environ
+    <3b2>   DW_AT_decl_file   : (data1) 11
+    <3b3>   DW_AT_decl_line   : (data2) 548
+    <3b5>   DW_AT_type        : (ref4) <0x3a7>, char
+    <3b9>   DW_AT_external    : (flag_present) 1
+    <3b9>   DW_AT_declaration : (flag_present) 1
+ <1><3b9>: Abbrev Number: 16 (DW_TAG_variable)
+    <3ba>   DW_AT_name        : (strp) (offset: 0xa43): optarg
+    <3be>   DW_AT_decl_file   : (data1) 12
+    <3bf>   DW_AT_decl_line   : (data1) 57
+    <3c0>   DW_AT_type        : (ref4) <0xb5>, char
+    <3c4>   DW_AT_external    : (flag_present) 1
+    <3c4>   DW_AT_declaration : (flag_present) 1
+ <1><3c4>: Abbrev Number: 16 (DW_TAG_variable)
+    <3c5>   DW_AT_name        : (strp) (offset: 0x2e93): optind
+    <3c9>   DW_AT_decl_file   : (data1) 12
+    <3ca>   DW_AT_decl_line   : (data1) 71
+    <3cb>   DW_AT_type        : (ref4) <0x68>, int
+    <3cf>   DW_AT_external    : (flag_present) 1
+    <3cf>   DW_AT_declaration : (flag_present) 1
+ <1><3cf>: Abbrev Number: 16 (DW_TAG_variable)
+    <3d0>   DW_AT_name        : (strp) (offset: 0x1d71): opterr
+    <3d4>   DW_AT_decl_file   : (data1) 12
+    <3d5>   DW_AT_decl_line   : (data1) 76
+    <3d6>   DW_AT_type        : (ref4) <0x68>, int
+    <3da>   DW_AT_external    : (flag_present) 1
+    <3da>   DW_AT_declaration : (flag_present) 1
+ <1><3da>: Abbrev Number: 16 (DW_TAG_variable)
+    <3db>   DW_AT_name        : (strp) (offset: 0x1b04): optopt
+    <3df>   DW_AT_decl_file   : (data1) 12
+    <3e0>   DW_AT_decl_line   : (data1) 80
+    <3e1>   DW_AT_type        : (ref4) <0x68>, int
+    <3e5>   DW_AT_external    : (flag_present) 1
+    <3e5>   DW_AT_declaration : (flag_present) 1
+ <1><3e5>: Abbrev Number: 2 (DW_TAG_typedef)
+    <3e6>   DW_AT_name        : (strp) (offset: 0x206b): uint32_t
+    <3ea>   DW_AT_decl_file   : (data1) 13
+    <3eb>   DW_AT_decl_line   : (data1) 51
+    <3ec>   DW_AT_type        : (ref4) <0x4e>, unsigned int
+ <1><3f0>: Abbrev Number: 2 (DW_TAG_typedef)
+    <3f1>   DW_AT_name        : (strp) (offset: 0xf00): uint64_t
+    <3f5>   DW_AT_decl_file   : (data1) 13
+    <3f6>   DW_AT_decl_line   : (data1) 55
+    <3f7>   DW_AT_type        : (ref4) <0x34>, long unsigned int
  <1><3fb>: Abbrev Number: 2 (DW_TAG_typedef)
-    <3fc>   DW_AT_name        : (strp) (offset: 0x159d): Py_hash_t
+    <3fc>   DW_AT_name        : (strp) (offset: 0x2dac): Py_ssize_t
     <400>   DW_AT_decl_file   : (data1) 14
-    <401>   DW_AT_decl_line   : (data1) 114
-    <402>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><406>: Abbrev Number: 3 (DW_TAG_base_type)
-    <407>   DW_AT_byte_size   : (data1) 4
-    <408>   DW_AT_encoding    : (data1) 4	(float)
-    <409>   DW_AT_name        : (strp) (offset: 0x1e75): float
- <1><40d>: Abbrev Number: 3 (DW_TAG_base_type)
-    <40e>   DW_AT_byte_size   : (data1) 8
-    <40f>   DW_AT_encoding    : (data1) 4	(float)
-    <410>   DW_AT_name        : (strp) (offset: 0x1fa1): double
- <1><414>: Abbrev Number: 16 (DW_TAG_variable)
-    <415>   DW_AT_name        : (strp) (offset: 0x156b): signgam
-    <419>   DW_AT_decl_file   : (data1) 15
-    <41a>   DW_AT_decl_line   : (data1) 168
-    <41b>   DW_AT_type        : (ref4) <0x68>, int
-    <41f>   DW_AT_external    : (flag_present) 1
-    <41f>   DW_AT_declaration : (flag_present) 1
- <1><41f>: Abbrev Number: 19 (DW_TAG_enumeration_type)
-    <420>   DW_AT_byte_size   : (data1) 4
-    <421>   DW_AT_type        : (ref4) <0x68>, int
-    <425>   DW_AT_decl_file   : (data1) 15
-    <426>   DW_AT_decl_line   : (data2) 348
-    <428>   DW_AT_sibling     : (ref4) <0x44b>
- <2><42c>: Abbrev Number: 20 (DW_TAG_enumerator)
-    <42d>   DW_AT_name        : (strp) (offset: 0x2cf0): _IEEE_
-    <431>   DW_AT_const_value : (sdata) -1
- <2><432>: Abbrev Number: 21 (DW_TAG_enumerator)
-    <433>   DW_AT_name        : (strp) (offset: 0x1db9): _SVID_
-    <437>   DW_AT_const_value : (data1) 0
- <2><438>: Abbrev Number: 21 (DW_TAG_enumerator)
-    <439>   DW_AT_name        : (strp) (offset: 0x24c3): _XOPEN_
-    <43d>   DW_AT_const_value : (data1) 1
- <2><43e>: Abbrev Number: 21 (DW_TAG_enumerator)
-    <43f>   DW_AT_name        : (strp) (offset: 0x315a): _POSIX_
-    <443>   DW_AT_const_value : (data1) 2
- <2><444>: Abbrev Number: 21 (DW_TAG_enumerator)
-    <445>   DW_AT_name        : (strp) (offset: 0x1cfa): _ISOC_
-    <449>   DW_AT_const_value : (data1) 3
- <2><44a>: Abbrev Number: 0
- <1><44b>: Abbrev Number: 18 (DW_TAG_typedef)
-    <44c>   DW_AT_name        : (strp) (offset: 0x3cc): _LIB_VERSION_TYPE
-    <450>   DW_AT_decl_file   : (data1) 15
-    <451>   DW_AT_decl_line   : (data2) 354
-    <453>   DW_AT_type        : (ref4) <0x41f>, int
- <1><457>: Abbrev Number: 15 (DW_TAG_variable)
-    <458>   DW_AT_name        : (strp) (offset: 0xa23): _LIB_VERSION
-    <45c>   DW_AT_decl_file   : (data1) 15
-    <45d>   DW_AT_decl_line   : (data2) 359
-    <45f>   DW_AT_type        : (ref4) <0x44b>, _LIB_VERSION_TYPE, int
-    <463>   DW_AT_external    : (flag_present) 1
-    <463>   DW_AT_declaration : (flag_present) 1
- <1><463>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <464>   DW_AT_name        : (strp) (offset: 0x1792): timezone
-    <468>   DW_AT_byte_size   : (data1) 8
-    <469>   DW_AT_decl_file   : (data1) 16
-    <46a>   DW_AT_decl_line   : (data1) 55
-    <46b>   DW_AT_sibling     : (ref4) <0x488>
- <2><46f>: Abbrev Number: 9 (DW_TAG_member)
-    <470>   DW_AT_name        : (strp) (offset: 0x3162): tz_minuteswest
-    <474>   DW_AT_decl_file   : (data1) 16
-    <475>   DW_AT_decl_line   : (data1) 57
-    <476>   DW_AT_type        : (ref4) <0x68>, int
-    <47a>   DW_AT_data_member_location: (data1) 0
- <2><47b>: Abbrev Number: 9 (DW_TAG_member)
-    <47c>   DW_AT_name        : (strp) (offset: 0x1d0c): tz_dsttime
-    <480>   DW_AT_decl_file   : (data1) 16
-    <481>   DW_AT_decl_line   : (data1) 58
-    <482>   DW_AT_type        : (ref4) <0x68>, int
-    <486>   DW_AT_data_member_location: (data1) 4
- <2><487>: Abbrev Number: 0
- <1><488>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <489>   DW_AT_byte_size   : (data1) 8
-    <48a>   DW_AT_type        : (ref4) <0x463>, timezone
- <1><48e>: Abbrev Number: 22 (DW_TAG_restrict_type)
-    <48f>   DW_AT_type        : (ref4) <0x488>, timezone
- <1><493>: Abbrev Number: 12 (DW_TAG_array_type)
-    <494>   DW_AT_type        : (ref4) <0xa5>, char
-    <498>   DW_AT_sibling     : (ref4) <0x4a3>
- <2><49c>: Abbrev Number: 13 (DW_TAG_subrange_type)
-    <49d>   DW_AT_type        : (ref4) <0x91>, sizetype
-    <4a1>   DW_AT_upper_bound : (data1) 1
- <2><4a2>: Abbrev Number: 0
- <1><4a3>: Abbrev Number: 15 (DW_TAG_variable)
-    <4a4>   DW_AT_name        : (strp) (offset: 0x86f): __tzname
-    <4a8>   DW_AT_decl_file   : (data1) 17
-    <4a9>   DW_AT_decl_line   : (data2) 282
-    <4ab>   DW_AT_type        : (ref4) <0x493>, char
-    <4af>   DW_AT_external    : (flag_present) 1
-    <4af>   DW_AT_declaration : (flag_present) 1
- <1><4af>: Abbrev Number: 15 (DW_TAG_variable)
-    <4b0>   DW_AT_name        : (strp) (offset: 0x267e): __daylight
-    <4b4>   DW_AT_decl_file   : (data1) 17
-    <4b5>   DW_AT_decl_line   : (data2) 283
-    <4b7>   DW_AT_type        : (ref4) <0x68>, int
-    <4bb>   DW_AT_external    : (flag_present) 1
-    <4bb>   DW_AT_declaration : (flag_present) 1
- <1><4bb>: Abbrev Number: 15 (DW_TAG_variable)
-    <4bc>   DW_AT_name        : (strp) (offset: 0x1790): __timezone
-    <4c0>   DW_AT_decl_file   : (data1) 17
-    <4c1>   DW_AT_decl_line   : (data2) 284
-    <4c3>   DW_AT_type        : (ref4) <0x74>, long int
-    <4c7>   DW_AT_external    : (flag_present) 1
-    <4c7>   DW_AT_declaration : (flag_present) 1
- <1><4c7>: Abbrev Number: 15 (DW_TAG_variable)
-    <4c8>   DW_AT_name        : (strp) (offset: 0x871): tzname
-    <4cc>   DW_AT_decl_file   : (data1) 17
-    <4cd>   DW_AT_decl_line   : (data2) 289
-    <4cf>   DW_AT_type        : (ref4) <0x493>, char
-    <4d3>   DW_AT_external    : (flag_present) 1
-    <4d3>   DW_AT_declaration : (flag_present) 1
- <1><4d3>: Abbrev Number: 15 (DW_TAG_variable)
-    <4d4>   DW_AT_name        : (strp) (offset: 0x2680): daylight
-    <4d8>   DW_AT_decl_file   : (data1) 17
-    <4d9>   DW_AT_decl_line   : (data2) 297
-    <4db>   DW_AT_type        : (ref4) <0x68>, int
-    <4df>   DW_AT_external    : (flag_present) 1
-    <4df>   DW_AT_declaration : (flag_present) 1
- <1><4df>: Abbrev Number: 15 (DW_TAG_variable)
-    <4e0>   DW_AT_name        : (strp) (offset: 0x1792): timezone
-    <4e4>   DW_AT_decl_file   : (data1) 17
-    <4e5>   DW_AT_decl_line   : (data2) 298
-    <4e7>   DW_AT_type        : (ref4) <0x74>, long int
-    <4eb>   DW_AT_external    : (flag_present) 1
-    <4eb>   DW_AT_declaration : (flag_present) 1
- <1><4eb>: Abbrev Number: 15 (DW_TAG_variable)
-    <4ec>   DW_AT_name        : (strp) (offset: 0x1275): getdate_err
-    <4f0>   DW_AT_decl_file   : (data1) 17
-    <4f1>   DW_AT_decl_line   : (data2) 403
-    <4f3>   DW_AT_type        : (ref4) <0x68>, int
-    <4f7>   DW_AT_external    : (flag_present) 1
-    <4f7>   DW_AT_declaration : (flag_present) 1
- <1><4f7>: Abbrev Number: 2 (DW_TAG_typedef)
-    <4f8>   DW_AT_name        : (strp) (offset: 0xb38): PyTypeObject
-    <4fc>   DW_AT_decl_file   : (data1) 2
-    <4fd>   DW_AT_decl_line   : (data1) 66
-    <4fe>   DW_AT_type        : (ref4) <0x507>, _typeobject
- <1><502>: Abbrev Number: 4 (DW_TAG_const_type)
-    <503>   DW_AT_type        : (ref4) <0x4f7>, PyTypeObject, _typeobject
- <1><507>: Abbrev Number: 23 (DW_TAG_structure_type)
-    <508>   DW_AT_name        : (strp) (offset: 0x562): _typeobject
-    <50c>   DW_AT_byte_size   : (data2) 408
-    <50e>   DW_AT_decl_file   : (data1) 18
-    <50f>   DW_AT_decl_line   : (data1) 193
-    <510>   DW_AT_sibling     : (ref4) <0x783>
- <2><514>: Abbrev Number: 9 (DW_TAG_member)
-    <515>   DW_AT_name        : (strp) (offset: 0xb30): ob_base
-    <519>   DW_AT_decl_file   : (data1) 18
-    <51a>   DW_AT_decl_line   : (data1) 194
-    <51b>   DW_AT_type        : (ref4) <0x7df>, PyVarObject
-    <51f>   DW_AT_data_member_location: (data1) 0
- <2><520>: Abbrev Number: 9 (DW_TAG_member)
-    <521>   DW_AT_name        : (strp) (offset: 0x19e2): tp_name
-    <525>   DW_AT_decl_file   : (data1) 18
-    <526>   DW_AT_decl_line   : (data1) 195
-    <527>   DW_AT_type        : (ref4) <0x2d2>, char
-    <52b>   DW_AT_data_member_location: (data1) 24
- <2><52c>: Abbrev Number: 9 (DW_TAG_member)
-    <52d>   DW_AT_name        : (strp) (offset: 0x3102): tp_basicsize
-    <531>   DW_AT_decl_file   : (data1) 18
-    <532>   DW_AT_decl_line   : (data1) 196
-    <533>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <537>   DW_AT_data_member_location: (data1) 32
- <2><538>: Abbrev Number: 9 (DW_TAG_member)
-    <539>   DW_AT_name        : (strp) (offset: 0x3a0): tp_itemsize
-    <53d>   DW_AT_decl_file   : (data1) 18
-    <53e>   DW_AT_decl_line   : (data1) 196
-    <53f>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <543>   DW_AT_data_member_location: (data1) 40
- <2><544>: Abbrev Number: 9 (DW_TAG_member)
-    <545>   DW_AT_name        : (strp) (offset: 0x535): tp_dealloc
-    <549>   DW_AT_decl_file   : (data1) 18
-    <54a>   DW_AT_decl_line   : (data1) 200
-    <54b>   DW_AT_type        : (ref4) <0x9ad>, destructor
-    <54f>   DW_AT_data_member_location: (data1) 48
- <2><550>: Abbrev Number: 9 (DW_TAG_member)
-    <551>   DW_AT_name        : (strp) (offset: 0x1f03): tp_vectorcall_offset
-    <555>   DW_AT_decl_file   : (data1) 18
-    <556>   DW_AT_decl_line   : (data1) 201
-    <557>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <55b>   DW_AT_data_member_location: (data1) 56
- <2><55c>: Abbrev Number: 9 (DW_TAG_member)
-    <55d>   DW_AT_name        : (strp) (offset: 0x13e): tp_getattr
-    <561>   DW_AT_decl_file   : (data1) 18
-    <562>   DW_AT_decl_line   : (data1) 202
-    <563>   DW_AT_type        : (ref4) <0x9c9>, getattrfunc, PyObject, _object
-    <567>   DW_AT_data_member_location: (data1) 64
- <2><568>: Abbrev Number: 9 (DW_TAG_member)
-    <569>   DW_AT_name        : (strp) (offset: 0xc0e): tp_setattr
-    <56d>   DW_AT_decl_file   : (data1) 18
-    <56e>   DW_AT_decl_line   : (data1) 203
-    <56f>   DW_AT_type        : (ref4) <0x9f9>, setattrfunc, int
-    <573>   DW_AT_data_member_location: (data1) 72
- <2><574>: Abbrev Number: 9 (DW_TAG_member)
-    <575>   DW_AT_name        : (strp) (offset: 0x218): tp_as_async
-    <579>   DW_AT_decl_file   : (data1) 18
-    <57a>   DW_AT_decl_line   : (data1) 204
-    <57b>   DW_AT_type        : (ref4) <0xf5b>, PyAsyncMethods
-    <57f>   DW_AT_data_member_location: (data1) 80
- <2><580>: Abbrev Number: 9 (DW_TAG_member)
-    <581>   DW_AT_name        : (strp) (offset: 0x2b1a): tp_repr
-    <585>   DW_AT_decl_file   : (data1) 18
-    <586>   DW_AT_decl_line   : (data1) 206
-    <587>   DW_AT_type        : (ref4) <0xa2e>, reprfunc, PyObject, _object
-    <58b>   DW_AT_data_member_location: (data1) 88
- <2><58c>: Abbrev Number: 9 (DW_TAG_member)
-    <58d>   DW_AT_name        : (strp) (offset: 0x1fd6): tp_as_number
-    <591>   DW_AT_decl_file   : (data1) 18
-    <592>   DW_AT_decl_line   : (data1) 210
-    <593>   DW_AT_type        : (ref4) <0xf61>, PyNumberMethods
-    <597>   DW_AT_data_member_location: (data1) 96
- <2><598>: Abbrev Number: 9 (DW_TAG_member)
-    <599>   DW_AT_name        : (strp) (offset: 0x1a41): tp_as_sequence
-    <59d>   DW_AT_decl_file   : (data1) 18
-    <59e>   DW_AT_decl_line   : (data1) 211
-    <59f>   DW_AT_type        : (ref4) <0xf67>, PySequenceMethods
-    <5a3>   DW_AT_data_member_location: (data1) 104
- <2><5a4>: Abbrev Number: 9 (DW_TAG_member)
-    <5a5>   DW_AT_name        : (strp) (offset: 0x1078): tp_as_mapping
-    <5a9>   DW_AT_decl_file   : (data1) 18
-    <5aa>   DW_AT_decl_line   : (data1) 212
-    <5ab>   DW_AT_type        : (ref4) <0xf6d>, PyMappingMethods
-    <5af>   DW_AT_data_member_location: (data1) 112
- <2><5b0>: Abbrev Number: 9 (DW_TAG_member)
-    <5b1>   DW_AT_name        : (strp) (offset: 0x2300): tp_hash
-    <5b5>   DW_AT_decl_file   : (data1) 18
-    <5b6>   DW_AT_decl_line   : (data1) 216
-    <5b7>   DW_AT_type        : (ref4) <0xa39>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
-    <5bb>   DW_AT_data_member_location: (data1) 120
- <2><5bc>: Abbrev Number: 9 (DW_TAG_member)
-    <5bd>   DW_AT_name        : (strp) (offset: 0xa5e): tp_call
-    <5c1>   DW_AT_decl_file   : (data1) 18
-    <5c2>   DW_AT_decl_line   : (data1) 217
-    <5c3>   DW_AT_type        : (ref4) <0x83a>, ternaryfunc, PyObject, _object
-    <5c7>   DW_AT_data_member_location: (data1) 128
- <2><5c8>: Abbrev Number: 9 (DW_TAG_member)
-    <5c9>   DW_AT_name        : (strp) (offset: 0xaaa): tp_str
-    <5cd>   DW_AT_decl_file   : (data1) 18
-    <5ce>   DW_AT_decl_line   : (data1) 218
-    <5cf>   DW_AT_type        : (ref4) <0xa2e>, reprfunc, PyObject, _object
-    <5d3>   DW_AT_data_member_location: (data1) 136
- <2><5d4>: Abbrev Number: 9 (DW_TAG_member)
-    <5d5>   DW_AT_name        : (strp) (offset: 0x1bfd): tp_getattro
-    <5d9>   DW_AT_decl_file   : (data1) 18
-    <5da>   DW_AT_decl_line   : (data1) 219
-    <5db>   DW_AT_type        : (ref4) <0x9ee>, getattrofunc, PyObject, _object
-    <5df>   DW_AT_data_member_location: (data1) 144
- <2><5e0>: Abbrev Number: 9 (DW_TAG_member)
-    <5e1>   DW_AT_name        : (strp) (offset: 0x2637): tp_setattro
-    <5e5>   DW_AT_decl_file   : (data1) 18
-    <5e6>   DW_AT_decl_line   : (data1) 220
-    <5e7>   DW_AT_type        : (ref4) <0xa23>, setattrofunc, int
-    <5eb>   DW_AT_data_member_location: (data1) 152
- <2><5ec>: Abbrev Number: 9 (DW_TAG_member)
-    <5ed>   DW_AT_name        : (strp) (offset: 0x1a68): tp_as_buffer
-    <5f1>   DW_AT_decl_file   : (data1) 18
-    <5f2>   DW_AT_decl_line   : (data1) 223
-    <5f3>   DW_AT_type        : (ref4) <0xf73>, PyBufferProcs
-    <5f7>   DW_AT_data_member_location: (data1) 160
- <2><5f8>: Abbrev Number: 9 (DW_TAG_member)
-    <5f9>   DW_AT_name        : (strp) (offset: 0x2dd7): tp_flags
-    <5fd>   DW_AT_decl_file   : (data1) 18
-    <5fe>   DW_AT_decl_line   : (data1) 226
-    <5ff>   DW_AT_type        : (ref4) <0x34>, long unsigned int
-    <603>   DW_AT_data_member_location: (data1) 168
- <2><604>: Abbrev Number: 9 (DW_TAG_member)
-    <605>   DW_AT_name        : (strp) (offset: 0x20a9): tp_doc
-    <609>   DW_AT_decl_file   : (data1) 18
-    <60a>   DW_AT_decl_line   : (data1) 228
-    <60b>   DW_AT_type        : (ref4) <0x2d2>, char
-    <60f>   DW_AT_data_member_location: (data1) 176
- <2><610>: Abbrev Number: 9 (DW_TAG_member)
-    <611>   DW_AT_name        : (strp) (offset: 0x253b): tp_traverse
-    <615>   DW_AT_decl_file   : (data1) 18
-    <616>   DW_AT_decl_line   : (data1) 232
-    <617>   DW_AT_type        : (ref4) <0x967>, traverseproc, int
-    <61b>   DW_AT_data_member_location: (data1) 184
- <2><61c>: Abbrev Number: 9 (DW_TAG_member)
-    <61d>   DW_AT_name        : (strp) (offset: 0xe05): tp_clear
-    <621>   DW_AT_decl_file   : (data1) 18
-    <622>   DW_AT_decl_line   : (data1) 235
-    <623>   DW_AT_type        : (ref4) <0x864>, inquiry, int
-    <627>   DW_AT_data_member_location: (data1) 192
- <2><628>: Abbrev Number: 9 (DW_TAG_member)
-    <629>   DW_AT_name        : (strp) (offset: 0x6e7): tp_richcompare
-    <62d>   DW_AT_decl_file   : (data1) 18
-    <62e>   DW_AT_decl_line   : (data1) 239
-    <62f>   DW_AT_type        : (ref4) <0xa59>, richcmpfunc, PyObject, _object
-    <633>   DW_AT_data_member_location: (data1) 200
- <2><634>: Abbrev Number: 9 (DW_TAG_member)
-    <635>   DW_AT_name        : (strp) (offset: 0x2036): tp_weaklistoffset
-    <639>   DW_AT_decl_file   : (data1) 18
-    <63a>   DW_AT_decl_line   : (data1) 242
-    <63b>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <63f>   DW_AT_data_member_location: (data1) 208
- <2><640>: Abbrev Number: 9 (DW_TAG_member)
-    <641>   DW_AT_name        : (strp) (offset: 0x275a): tp_iter
-    <645>   DW_AT_decl_file   : (data1) 18
-    <646>   DW_AT_decl_line   : (data1) 245
-    <647>   DW_AT_type        : (ref4) <0xa83>, getiterfunc, PyObject, _object
-    <64b>   DW_AT_data_member_location: (data1) 216
- <2><64c>: Abbrev Number: 9 (DW_TAG_member)
-    <64d>   DW_AT_name        : (strp) (offset: 0x26be): tp_iternext
-    <651>   DW_AT_decl_file   : (data1) 18
-    <652>   DW_AT_decl_line   : (data1) 246
-    <653>   DW_AT_type        : (ref4) <0xa8e>, iternextfunc, PyObject, _object
-    <657>   DW_AT_data_member_location: (data1) 224
- <2><658>: Abbrev Number: 9 (DW_TAG_member)
-    <659>   DW_AT_name        : (strp) (offset: 0x1cc7): tp_methods
-    <65d>   DW_AT_decl_file   : (data1) 18
-    <65e>   DW_AT_decl_line   : (data1) 249
-    <65f>   DW_AT_type        : (ref4) <0xfb6>, PyMethodDef
-    <663>   DW_AT_data_member_location: (data1) 232
- <2><664>: Abbrev Number: 9 (DW_TAG_member)
-    <665>   DW_AT_name        : (strp) (offset: 0x251a): tp_members
-    <669>   DW_AT_decl_file   : (data1) 18
-    <66a>   DW_AT_decl_line   : (data1) 250
-    <66b>   DW_AT_type        : (ref4) <0xfc1>, PyMemberDef
-    <66f>   DW_AT_data_member_location: (data1) 240
- <2><670>: Abbrev Number: 9 (DW_TAG_member)
-    <671>   DW_AT_name        : (strp) (offset: 0x269f): tp_getset
-    <675>   DW_AT_decl_file   : (data1) 18
-    <676>   DW_AT_decl_line   : (data1) 251
-    <677>   DW_AT_type        : (ref4) <0x1010>, PyGetSetDef
-    <67b>   DW_AT_data_member_location: (data1) 248
- <2><67c>: Abbrev Number: 24 (DW_TAG_member)
-    <67d>   DW_AT_name        : (strp) (offset: 0x282e): tp_base
-    <681>   DW_AT_decl_file   : (data1) 18
-    <682>   DW_AT_decl_line   : (data1) 252
-    <683>   DW_AT_type        : (ref4) <0x1016>, _typeobject
-    <687>   DW_AT_data_member_location: (data2) 256
- <2><689>: Abbrev Number: 24 (DW_TAG_member)
-    <68a>   DW_AT_name        : (strp) (offset: 0x1030): tp_dict
-    <68e>   DW_AT_decl_file   : (data1) 18
-    <68f>   DW_AT_decl_line   : (data1) 253
-    <690>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <694>   DW_AT_data_member_location: (data2) 264
- <2><696>: Abbrev Number: 24 (DW_TAG_member)
-    <697>   DW_AT_name        : (strp) (offset: 0x273f): tp_descr_get
-    <69b>   DW_AT_decl_file   : (data1) 18
-    <69c>   DW_AT_decl_line   : (data1) 254
-    <69d>   DW_AT_type        : (ref4) <0xa99>, descrgetfunc, PyObject, _object
-    <6a1>   DW_AT_data_member_location: (data2) 272
- <2><6a3>: Abbrev Number: 24 (DW_TAG_member)
-    <6a4>   DW_AT_name        : (strp) (offset: 0x304c): tp_descr_set
-    <6a8>   DW_AT_decl_file   : (data1) 18
-    <6a9>   DW_AT_decl_line   : (data1) 255
-    <6aa>   DW_AT_type        : (ref4) <0xaa4>, descrsetfunc, int
-    <6ae>   DW_AT_data_member_location: (data2) 280
- <2><6b0>: Abbrev Number: 25 (DW_TAG_member)
-    <6b1>   DW_AT_name        : (strp) (offset: 0xd52): tp_dictoffset
-    <6b5>   DW_AT_decl_file   : (data1) 18
-    <6b6>   DW_AT_decl_line   : (data2) 256
-    <6b8>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <6bc>   DW_AT_data_member_location: (data2) 288
- <2><6be>: Abbrev Number: 25 (DW_TAG_member)
-    <6bf>   DW_AT_name        : (strp) (offset: 0xfb5): tp_init
-    <6c3>   DW_AT_decl_file   : (data1) 18
-    <6c4>   DW_AT_decl_line   : (data2) 257
-    <6c6>   DW_AT_type        : (ref4) <0xaaf>, initproc, int
-    <6ca>   DW_AT_data_member_location: (data2) 296
- <2><6cc>: Abbrev Number: 25 (DW_TAG_member)
-    <6cd>   DW_AT_name        : (strp) (offset: 0x1af4): tp_alloc
-    <6d1>   DW_AT_decl_file   : (data1) 18
-    <6d2>   DW_AT_decl_line   : (data2) 258
-    <6d4>   DW_AT_type        : (ref4) <0xae4>, allocfunc, PyObject, _object
-    <6d8>   DW_AT_data_member_location: (data2) 304
- <2><6da>: Abbrev Number: 25 (DW_TAG_member)
-    <6db>   DW_AT_name        : (strp) (offset: 0x181c): tp_new
-    <6df>   DW_AT_decl_file   : (data1) 18
-    <6e0>   DW_AT_decl_line   : (data2) 259
-    <6e2>   DW_AT_type        : (ref4) <0xaba>, newfunc, PyObject, _object
-    <6e6>   DW_AT_data_member_location: (data2) 312
- <2><6e8>: Abbrev Number: 25 (DW_TAG_member)
-    <6e9>   DW_AT_name        : (strp) (offset: 0x8f2): tp_free
-    <6ed>   DW_AT_decl_file   : (data1) 18
-    <6ee>   DW_AT_decl_line   : (data2) 260
-    <6f0>   DW_AT_type        : (ref4) <0x991>, freefunc
-    <6f4>   DW_AT_data_member_location: (data2) 320
- <2><6f6>: Abbrev Number: 25 (DW_TAG_member)
-    <6f7>   DW_AT_name        : (strp) (offset: 0x28e): tp_is_gc
-    <6fb>   DW_AT_decl_file   : (data1) 18
-    <6fc>   DW_AT_decl_line   : (data2) 261
-    <6fe>   DW_AT_type        : (ref4) <0x864>, inquiry, int
-    <702>   DW_AT_data_member_location: (data2) 328
- <2><704>: Abbrev Number: 25 (DW_TAG_member)
-    <705>   DW_AT_name        : (strp) (offset: 0x437): tp_bases
-    <709>   DW_AT_decl_file   : (data1) 18
-    <70a>   DW_AT_decl_line   : (data2) 262
-    <70c>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <710>   DW_AT_data_member_location: (data2) 336
- <2><712>: Abbrev Number: 25 (DW_TAG_member)
-    <713>   DW_AT_name        : (strp) (offset: 0x1ce1): tp_mro
-    <717>   DW_AT_decl_file   : (data1) 18
-    <718>   DW_AT_decl_line   : (data2) 263
-    <71a>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <71e>   DW_AT_data_member_location: (data2) 344
- <2><720>: Abbrev Number: 25 (DW_TAG_member)
-    <721>   DW_AT_name        : (strp) (offset: 0x2b37): tp_cache
-    <725>   DW_AT_decl_file   : (data1) 18
-    <726>   DW_AT_decl_line   : (data2) 264
-    <728>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <72c>   DW_AT_data_member_location: (data2) 352
- <2><72e>: Abbrev Number: 25 (DW_TAG_member)
-    <72f>   DW_AT_name        : (strp) (offset: 0x25db): tp_subclasses
-    <733>   DW_AT_decl_file   : (data1) 18
-    <734>   DW_AT_decl_line   : (data2) 265
-    <736>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <73a>   DW_AT_data_member_location: (data2) 360
- <2><73c>: Abbrev Number: 25 (DW_TAG_member)
-    <73d>   DW_AT_name        : (strp) (offset: 0x2174): tp_weaklist
-    <741>   DW_AT_decl_file   : (data1) 18
-    <742>   DW_AT_decl_line   : (data2) 266
-    <744>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <748>   DW_AT_data_member_location: (data2) 368
- <2><74a>: Abbrev Number: 25 (DW_TAG_member)
-    <74b>   DW_AT_name        : (strp) (offset: 0x1972): tp_del
-    <74f>   DW_AT_decl_file   : (data1) 18
-    <750>   DW_AT_decl_line   : (data2) 267
-    <752>   DW_AT_type        : (ref4) <0x9ad>, destructor
-    <756>   DW_AT_data_member_location: (data2) 376
- <2><758>: Abbrev Number: 25 (DW_TAG_member)
-    <759>   DW_AT_name        : (strp) (offset: 0x23e1): tp_version_tag
-    <75d>   DW_AT_decl_file   : (data1) 18
-    <75e>   DW_AT_decl_line   : (data2) 270
-    <760>   DW_AT_type        : (ref4) <0x4e>, unsigned int
-    <764>   DW_AT_data_member_location: (data2) 384
- <2><766>: Abbrev Number: 25 (DW_TAG_member)
-    <767>   DW_AT_name        : (strp) (offset: 0xd9a): tp_finalize
-    <76b>   DW_AT_decl_file   : (data1) 18
-    <76c>   DW_AT_decl_line   : (data2) 272
-    <76e>   DW_AT_type        : (ref4) <0x9ad>, destructor
-    <772>   DW_AT_data_member_location: (data2) 392
- <2><774>: Abbrev Number: 25 (DW_TAG_member)
-    <775>   DW_AT_name        : (strp) (offset: 0x23a0): tp_vectorcall
-    <779>   DW_AT_decl_file   : (data1) 18
-    <77a>   DW_AT_decl_line   : (data2) 273
-    <77c>   DW_AT_type        : (ref4) <0xc35>, vectorcallfunc, PyObject, _object
-    <780>   DW_AT_data_member_location: (data2) 400
- <2><782>: Abbrev Number: 0
- <1><783>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <784>   DW_AT_name        : (strp) (offset: 0x82c): _object
-    <788>   DW_AT_byte_size   : (data1) 16
-    <789>   DW_AT_decl_file   : (data1) 2
-    <78a>   DW_AT_decl_line   : (data1) 105
-    <78b>   DW_AT_sibling     : (ref4) <0x7a8>
- <2><78f>: Abbrev Number: 9 (DW_TAG_member)
-    <790>   DW_AT_name        : (strp) (offset: 0x1b0): ob_refcnt
-    <794>   DW_AT_decl_file   : (data1) 2
-    <795>   DW_AT_decl_line   : (data1) 107
-    <796>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <79a>   DW_AT_data_member_location: (data1) 0
- <2><79b>: Abbrev Number: 9 (DW_TAG_member)
-    <79c>   DW_AT_name        : (strp) (offset: 0x8ab): ob_type
-    <7a0>   DW_AT_decl_file   : (data1) 2
-    <7a1>   DW_AT_decl_line   : (data1) 108
-    <7a2>   DW_AT_type        : (ref4) <0x7a8>, PyTypeObject, _typeobject
-    <7a6>   DW_AT_data_member_location: (data1) 8
- <2><7a7>: Abbrev Number: 0
- <1><7a8>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <7a9>   DW_AT_byte_size   : (data1) 8
-    <7aa>   DW_AT_type        : (ref4) <0x4f7>, PyTypeObject, _typeobject
- <1><7ae>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7af>   DW_AT_name        : (strp) (offset: 0x15d4): PyObject
-    <7b3>   DW_AT_decl_file   : (data1) 2
-    <7b4>   DW_AT_decl_line   : (data1) 109
-    <7b5>   DW_AT_type        : (ref4) <0x783>, _object
- <1><7b9>: Abbrev Number: 4 (DW_TAG_const_type)
-    <7ba>   DW_AT_type        : (ref4) <0x7ae>, PyObject, _object
- <1><7be>: Abbrev Number: 26 (DW_TAG_structure_type)
-    <7bf>   DW_AT_byte_size   : (data1) 24
-    <7c0>   DW_AT_decl_file   : (data1) 2
-    <7c1>   DW_AT_decl_line   : (data1) 115
-    <7c2>   DW_AT_sibling     : (ref4) <0x7df>
- <2><7c6>: Abbrev Number: 9 (DW_TAG_member)
-    <7c7>   DW_AT_name        : (strp) (offset: 0xb30): ob_base
-    <7cb>   DW_AT_decl_file   : (data1) 2
-    <7cc>   DW_AT_decl_line   : (data1) 116
-    <7cd>   DW_AT_type        : (ref4) <0x7ae>, PyObject, _object
-    <7d1>   DW_AT_data_member_location: (data1) 0
- <2><7d2>: Abbrev Number: 9 (DW_TAG_member)
-    <7d3>   DW_AT_name        : (strp) (offset: 0xfef): ob_size
-    <7d7>   DW_AT_decl_file   : (data1) 2
-    <7d8>   DW_AT_decl_line   : (data1) 117
-    <7d9>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <7dd>   DW_AT_data_member_location: (data1) 16
- <2><7de>: Abbrev Number: 0
- <1><7df>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7e0>   DW_AT_name        : (strp) (offset: 0x95a): PyVarObject
-    <7e4>   DW_AT_decl_file   : (data1) 2
-    <7e5>   DW_AT_decl_line   : (data1) 118
-    <7e6>   DW_AT_type        : (ref4) <0x7be>
- <1><7ea>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7eb>   DW_AT_name        : (strp) (offset: 0x1df2): unaryfunc
-    <7ef>   DW_AT_decl_file   : (data1) 2
-    <7f0>   DW_AT_decl_line   : (data1) 163
-    <7f1>   DW_AT_type        : (ref4) <0x7f5>, PyObject, _object
- <1><7f5>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <7f6>   DW_AT_byte_size   : (data1) 8
-    <7f7>   DW_AT_type        : (ref4) <0x7fb>, PyObject, _object
- <1><7fb>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <7fc>   DW_AT_prototyped  : (flag_present) 1
-    <7fc>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <800>   DW_AT_sibling     : (ref4) <0x80a>
- <2><804>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <805>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><809>: Abbrev Number: 0
- <1><80a>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <80b>   DW_AT_byte_size   : (data1) 8
-    <80c>   DW_AT_type        : (ref4) <0x7ae>, PyObject, _object
- <1><810>: Abbrev Number: 4 (DW_TAG_const_type)
-    <811>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <1><815>: Abbrev Number: 2 (DW_TAG_typedef)
-    <816>   DW_AT_name        : (strp) (offset: 0x10eb): binaryfunc
-    <81a>   DW_AT_decl_file   : (data1) 2
-    <81b>   DW_AT_decl_line   : (data1) 164
-    <81c>   DW_AT_type        : (ref4) <0x820>, PyObject, _object
- <1><820>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <821>   DW_AT_byte_size   : (data1) 8
-    <822>   DW_AT_type        : (ref4) <0x826>, PyObject, _object
- <1><826>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <827>   DW_AT_prototyped  : (flag_present) 1
-    <827>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <82b>   DW_AT_sibling     : (ref4) <0x83a>
- <2><82f>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <830>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><834>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <835>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><839>: Abbrev Number: 0
- <1><83a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <83b>   DW_AT_name        : (strp) (offset: 0xb08): ternaryfunc
-    <83f>   DW_AT_decl_file   : (data1) 2
-    <840>   DW_AT_decl_line   : (data1) 165
-    <841>   DW_AT_type        : (ref4) <0x845>, PyObject, _object
- <1><845>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <846>   DW_AT_byte_size   : (data1) 8
-    <847>   DW_AT_type        : (ref4) <0x84b>, PyObject, _object
- <1><84b>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <84c>   DW_AT_prototyped  : (flag_present) 1
-    <84c>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <850>   DW_AT_sibling     : (ref4) <0x864>
- <2><854>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <855>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><859>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <85a>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><85e>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <85f>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><863>: Abbrev Number: 0
- <1><864>: Abbrev Number: 2 (DW_TAG_typedef)
-    <865>   DW_AT_name        : (strp) (offset: 0x1f18): inquiry
-    <869>   DW_AT_decl_file   : (data1) 2
-    <86a>   DW_AT_decl_line   : (data1) 166
-    <86b>   DW_AT_type        : (ref4) <0x86f>, int
- <1><86f>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <870>   DW_AT_byte_size   : (data1) 8
-    <871>   DW_AT_type        : (ref4) <0x875>, int
- <1><875>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <876>   DW_AT_prototyped  : (flag_present) 1
-    <876>   DW_AT_type        : (ref4) <0x68>, int
-    <87a>   DW_AT_sibling     : (ref4) <0x884>
- <2><87e>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <87f>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><883>: Abbrev Number: 0
- <1><884>: Abbrev Number: 2 (DW_TAG_typedef)
-    <885>   DW_AT_name        : (strp) (offset: 0x8d): lenfunc
-    <889>   DW_AT_decl_file   : (data1) 2
-    <88a>   DW_AT_decl_line   : (data1) 167
-    <88b>   DW_AT_type        : (ref4) <0x88f>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><88f>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <890>   DW_AT_byte_size   : (data1) 8
-    <891>   DW_AT_type        : (ref4) <0x895>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><895>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <896>   DW_AT_prototyped  : (flag_present) 1
-    <896>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <89a>   DW_AT_sibling     : (ref4) <0x8a4>
- <2><89e>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <89f>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><8a3>: Abbrev Number: 0
- <1><8a4>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8a5>   DW_AT_name        : (strp) (offset: 0x123c): ssizeargfunc
-    <8a9>   DW_AT_decl_file   : (data1) 2
-    <8aa>   DW_AT_decl_line   : (data1) 168
-    <8ab>   DW_AT_type        : (ref4) <0x8af>, PyObject, _object
- <1><8af>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <8b0>   DW_AT_byte_size   : (data1) 8
-    <8b1>   DW_AT_type        : (ref4) <0x8b5>, PyObject, _object
- <1><8b5>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <8b6>   DW_AT_prototyped  : (flag_present) 1
-    <8b6>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <8ba>   DW_AT_sibling     : (ref4) <0x8c9>
- <2><8be>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <8bf>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><8c3>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <8c4>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
- <2><8c8>: Abbrev Number: 0
- <1><8c9>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8ca>   DW_AT_name        : (strp) (offset: 0x235a): ssizeobjargproc
-    <8ce>   DW_AT_decl_file   : (data1) 2
-    <8cf>   DW_AT_decl_line   : (data1) 170
-    <8d0>   DW_AT_type        : (ref4) <0x8d4>, int
- <1><8d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <8d5>   DW_AT_byte_size   : (data1) 8
-    <8d6>   DW_AT_type        : (ref4) <0x8da>, int
- <1><8da>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <8db>   DW_AT_prototyped  : (flag_present) 1
-    <8db>   DW_AT_type        : (ref4) <0x68>, int
-    <8df>   DW_AT_sibling     : (ref4) <0x8f3>
- <2><8e3>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <8e4>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><8e8>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <8e9>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
- <2><8ed>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <8ee>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><8f2>: Abbrev Number: 0
- <1><8f3>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8f4>   DW_AT_name        : (strp) (offset: 0xfe1): objobjargproc
-    <8f8>   DW_AT_decl_file   : (data1) 2
-    <8f9>   DW_AT_decl_line   : (data1) 172
-    <8fa>   DW_AT_type        : (ref4) <0x8fe>, int
- <1><8fe>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <8ff>   DW_AT_byte_size   : (data1) 8
-    <900>   DW_AT_type        : (ref4) <0x904>, int
- <1><904>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <905>   DW_AT_prototyped  : (flag_present) 1
-    <905>   DW_AT_type        : (ref4) <0x68>, int
-    <909>   DW_AT_sibling     : (ref4) <0x91d>
- <2><90d>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <90e>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><912>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <913>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><917>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <918>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><91c>: Abbrev Number: 0
- <1><91d>: Abbrev Number: 2 (DW_TAG_typedef)
-    <91e>   DW_AT_name        : (strp) (offset: 0x3171): objobjproc
-    <922>   DW_AT_decl_file   : (data1) 2
-    <923>   DW_AT_decl_line   : (data1) 174
-    <924>   DW_AT_type        : (ref4) <0x928>, int
- <1><928>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <929>   DW_AT_byte_size   : (data1) 8
-    <92a>   DW_AT_type        : (ref4) <0x92e>, int
- <1><92e>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <92f>   DW_AT_prototyped  : (flag_present) 1
-    <92f>   DW_AT_type        : (ref4) <0x68>, int
-    <933>   DW_AT_sibling     : (ref4) <0x942>
- <2><937>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <938>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><93c>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <93d>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><941>: Abbrev Number: 0
- <1><942>: Abbrev Number: 2 (DW_TAG_typedef)
-    <943>   DW_AT_name        : (strp) (offset: 0x776): visitproc
-    <947>   DW_AT_decl_file   : (data1) 2
-    <948>   DW_AT_decl_line   : (data1) 175
-    <949>   DW_AT_type        : (ref4) <0x94d>, int
- <1><94d>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <94e>   DW_AT_byte_size   : (data1) 8
-    <94f>   DW_AT_type        : (ref4) <0x953>, int
- <1><953>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <954>   DW_AT_prototyped  : (flag_present) 1
-    <954>   DW_AT_type        : (ref4) <0x68>, int
-    <958>   DW_AT_sibling     : (ref4) <0x967>
- <2><95c>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <95d>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><961>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <962>   DW_AT_type        : (ref4) <0x98>
- <2><966>: Abbrev Number: 0
- <1><967>: Abbrev Number: 2 (DW_TAG_typedef)
-    <968>   DW_AT_name        : (strp) (offset: 0x1ecb): traverseproc
-    <96c>   DW_AT_decl_file   : (data1) 2
-    <96d>   DW_AT_decl_line   : (data1) 176
-    <96e>   DW_AT_type        : (ref4) <0x972>, int
- <1><972>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <973>   DW_AT_byte_size   : (data1) 8
-    <974>   DW_AT_type        : (ref4) <0x978>, int
- <1><978>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <979>   DW_AT_prototyped  : (flag_present) 1
-    <979>   DW_AT_type        : (ref4) <0x68>, int
-    <97d>   DW_AT_sibling     : (ref4) <0x991>
- <2><981>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <982>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><986>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <987>   DW_AT_type        : (ref4) <0x942>, visitproc, int
- <2><98b>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <98c>   DW_AT_type        : (ref4) <0x98>
- <2><990>: Abbrev Number: 0
- <1><991>: Abbrev Number: 2 (DW_TAG_typedef)
-    <992>   DW_AT_name        : (strp) (offset: 0x264f): freefunc
-    <996>   DW_AT_decl_file   : (data1) 2
-    <997>   DW_AT_decl_line   : (data1) 179
-    <998>   DW_AT_type        : (ref4) <0x99c>
- <1><99c>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <99d>   DW_AT_byte_size   : (data1) 8
-    <99e>   DW_AT_type        : (ref4) <0x9a2>
- <1><9a2>: Abbrev Number: 29 (DW_TAG_subroutine_type)
-    <9a3>   DW_AT_prototyped  : (flag_present) 1
-    <9a3>   DW_AT_sibling     : (ref4) <0x9ad>
- <2><9a7>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <9a8>   DW_AT_type        : (ref4) <0x98>
- <2><9ac>: Abbrev Number: 0
- <1><9ad>: Abbrev Number: 2 (DW_TAG_typedef)
-    <9ae>   DW_AT_name        : (strp) (offset: 0x18c3): destructor
-    <9b2>   DW_AT_decl_file   : (data1) 2
-    <9b3>   DW_AT_decl_line   : (data1) 180
-    <9b4>   DW_AT_type        : (ref4) <0x9b8>
- <1><9b8>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <9b9>   DW_AT_byte_size   : (data1) 8
-    <9ba>   DW_AT_type        : (ref4) <0x9be>
- <1><9be>: Abbrev Number: 29 (DW_TAG_subroutine_type)
-    <9bf>   DW_AT_prototyped  : (flag_present) 1
-    <9bf>   DW_AT_sibling     : (ref4) <0x9c9>
- <2><9c3>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <9c4>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><9c8>: Abbrev Number: 0
- <1><9c9>: Abbrev Number: 2 (DW_TAG_typedef)
-    <9ca>   DW_AT_name        : (strp) (offset: 0x21d3): getattrfunc
-    <9ce>   DW_AT_decl_file   : (data1) 2
-    <9cf>   DW_AT_decl_line   : (data1) 181
-    <9d0>   DW_AT_type        : (ref4) <0x9d4>, PyObject, _object
- <1><9d4>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <9d5>   DW_AT_byte_size   : (data1) 8
-    <9d6>   DW_AT_type        : (ref4) <0x9da>, PyObject, _object
- <1><9da>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <9db>   DW_AT_prototyped  : (flag_present) 1
-    <9db>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <9df>   DW_AT_sibling     : (ref4) <0x9ee>
- <2><9e3>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <9e4>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><9e8>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <9e9>   DW_AT_type        : (ref4) <0xa5>, char
- <2><9ed>: Abbrev Number: 0
- <1><9ee>: Abbrev Number: 2 (DW_TAG_typedef)
-    <9ef>   DW_AT_name        : (strp) (offset: 0x20bc): getattrofunc
-    <9f3>   DW_AT_decl_file   : (data1) 2
-    <9f4>   DW_AT_decl_line   : (data1) 182
-    <9f5>   DW_AT_type        : (ref4) <0x820>, PyObject, _object
- <1><9f9>: Abbrev Number: 2 (DW_TAG_typedef)
-    <9fa>   DW_AT_name        : (strp) (offset: 0x1086): setattrfunc
-    <9fe>   DW_AT_decl_file   : (data1) 2
-    <9ff>   DW_AT_decl_line   : (data1) 183
-    <a00>   DW_AT_type        : (ref4) <0xa04>, int
- <1><a04>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <a05>   DW_AT_byte_size   : (data1) 8
-    <a06>   DW_AT_type        : (ref4) <0xa0a>, int
- <1><a0a>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <a0b>   DW_AT_prototyped  : (flag_present) 1
-    <a0b>   DW_AT_type        : (ref4) <0x68>, int
-    <a0f>   DW_AT_sibling     : (ref4) <0xa23>
- <2><a13>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <a14>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><a18>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <a19>   DW_AT_type        : (ref4) <0xa5>, char
- <2><a1d>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <a1e>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><a22>: Abbrev Number: 0
- <1><a23>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a24>   DW_AT_name        : (strp) (offset: 0x4f2): setattrofunc
-    <a28>   DW_AT_decl_file   : (data1) 2
-    <a29>   DW_AT_decl_line   : (data1) 184
-    <a2a>   DW_AT_type        : (ref4) <0x8fe>, int
- <1><a2e>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a2f>   DW_AT_name        : (strp) (offset: 0x1417): reprfunc
-    <a33>   DW_AT_decl_file   : (data1) 2
-    <a34>   DW_AT_decl_line   : (data1) 185
-    <a35>   DW_AT_type        : (ref4) <0x7f5>, PyObject, _object
- <1><a39>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a3a>   DW_AT_name        : (strp) (offset: 0x21ca): hashfunc
-    <a3e>   DW_AT_decl_file   : (data1) 2
-    <a3f>   DW_AT_decl_line   : (data1) 186
-    <a40>   DW_AT_type        : (ref4) <0xa44>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><a44>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <a45>   DW_AT_byte_size   : (data1) 8
-    <a46>   DW_AT_type        : (ref4) <0xa4a>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><a4a>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <a4b>   DW_AT_prototyped  : (flag_present) 1
-    <a4b>   DW_AT_type        : (ref4) <0x3fb>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
-    <a4f>   DW_AT_sibling     : (ref4) <0xa59>
- <2><a53>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <a54>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><a58>: Abbrev Number: 0
- <1><a59>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a5a>   DW_AT_name        : (strp) (offset: 0xc74): richcmpfunc
-    <a5e>   DW_AT_decl_file   : (data1) 2
-    <a5f>   DW_AT_decl_line   : (data1) 187
-    <a60>   DW_AT_type        : (ref4) <0xa64>, PyObject, _object
- <1><a64>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <a65>   DW_AT_byte_size   : (data1) 8
-    <a66>   DW_AT_type        : (ref4) <0xa6a>, PyObject, _object
- <1><a6a>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <a6b>   DW_AT_prototyped  : (flag_present) 1
-    <a6b>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <a6f>   DW_AT_sibling     : (ref4) <0xa83>
- <2><a73>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <a74>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><a78>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <a79>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><a7d>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <a7e>   DW_AT_type        : (ref4) <0x68>, int
- <2><a82>: Abbrev Number: 0
- <1><a83>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a84>   DW_AT_name        : (strp) (offset: 0x120a): getiterfunc
-    <a88>   DW_AT_decl_file   : (data1) 2
-    <a89>   DW_AT_decl_line   : (data1) 188
-    <a8a>   DW_AT_type        : (ref4) <0x7f5>, PyObject, _object
- <1><a8e>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a8f>   DW_AT_name        : (strp) (offset: 0x2fd9): iternextfunc
-    <a93>   DW_AT_decl_file   : (data1) 2
-    <a94>   DW_AT_decl_line   : (data1) 189
-    <a95>   DW_AT_type        : (ref4) <0x7f5>, PyObject, _object
- <1><a99>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a9a>   DW_AT_name        : (strp) (offset: 0x131b): descrgetfunc
-    <a9e>   DW_AT_decl_file   : (data1) 2
-    <a9f>   DW_AT_decl_line   : (data1) 190
-    <aa0>   DW_AT_type        : (ref4) <0x845>, PyObject, _object
- <1><aa4>: Abbrev Number: 2 (DW_TAG_typedef)
-    <aa5>   DW_AT_name        : (strp) (offset: 0x12ab): descrsetfunc
-    <aa9>   DW_AT_decl_file   : (data1) 2
-    <aaa>   DW_AT_decl_line   : (data1) 191
-    <aab>   DW_AT_type        : (ref4) <0x8fe>, int
- <1><aaf>: Abbrev Number: 2 (DW_TAG_typedef)
-    <ab0>   DW_AT_name        : (strp) (offset: 0x3c3): initproc
-    <ab4>   DW_AT_decl_file   : (data1) 2
-    <ab5>   DW_AT_decl_line   : (data1) 192
-    <ab6>   DW_AT_type        : (ref4) <0x8fe>, int
- <1><aba>: Abbrev Number: 2 (DW_TAG_typedef)
-    <abb>   DW_AT_name        : (strp) (offset: 0x21b7): newfunc
-    <abf>   DW_AT_decl_file   : (data1) 2
-    <ac0>   DW_AT_decl_line   : (data1) 193
-    <ac1>   DW_AT_type        : (ref4) <0xac5>, PyObject, _object
- <1><ac5>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <ac6>   DW_AT_byte_size   : (data1) 8
-    <ac7>   DW_AT_type        : (ref4) <0xacb>, PyObject, _object
- <1><acb>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <acc>   DW_AT_prototyped  : (flag_present) 1
-    <acc>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <ad0>   DW_AT_sibling     : (ref4) <0xae4>
- <2><ad4>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <ad5>   DW_AT_type        : (ref4) <0x7a8>, PyTypeObject, _typeobject
- <2><ad9>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <ada>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><ade>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <adf>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
- <2><ae3>: Abbrev Number: 0
- <1><ae4>: Abbrev Number: 2 (DW_TAG_typedef)
-    <ae5>   DW_AT_name        : (strp) (offset: 0x1c13): allocfunc
-    <ae9>   DW_AT_decl_file   : (data1) 2
-    <aea>   DW_AT_decl_line   : (data1) 194
-    <aeb>   DW_AT_type        : (ref4) <0xaef>, PyObject, _object
- <1><aef>: Abbrev Number: 7 (DW_TAG_pointer_type)
-    <af0>   DW_AT_byte_size   : (data1) 8
-    <af1>   DW_AT_type        : (ref4) <0xaf5>, PyObject, _object
- <1><af5>: Abbrev Number: 27 (DW_TAG_subroutine_type)
-    <af6>   DW_AT_prototyped  : (flag_present) 1
-    <af6>   DW_AT_type        : (ref4) <0x80a>, PyObject, _object
-    <afa>   DW_AT_sibling     : (ref4) <0xb09>
- <2><afe>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <aff>   DW_AT_type        : (ref4) <0x7a8>, PyTypeObject, _typeobject
- <2><b03>: Abbrev Number: 28 (DW_TAG_formal_parameter)
-    <b04>   DW_AT_type        : (ref4) <0x3eb>, Py_ssize_t, ssize_t, __ssize_t, long int
- <2><b08>: Abbrev Number: 0
- <1><b09>: Abbrev Number: 16 (DW_TAG_variable)
-    <b0a>   DW_AT_name        : (strp) (offset: 0x2eba): PyType_Type
-    <b0e>   DW_AT_decl_file   : (data1) 2
-    <b0f>   DW_AT_decl_line   : (data1) 227
-    <b10>   DW_AT_type        : (ref4) <0x4f7>, PyTypeObject, _typeobject
-    <b14>   DW_AT_external    : (flag_present) 1
-    <b14>   DW_AT_declaration : (flag_present) 1
- <1><b14>: Abbrev Number: 16 (DW_TAG_variable)
-    <b15>   DW_AT_name        : (strp) (offset: 0x1df): PyBaseObject_Type
-    <b19>   DW_AT_decl_file   : (data1) 2
-    <b1a>   DW_AT_decl_line   : (data1) 228
-    <b1b>   DW_AT_type        : (ref4) <0x4f7>, PyTypeObject, _typeobject
-    <b1f>   DW_AT_external    : (flag_present) 1
-    <b1f>   DW_AT_declaration : (flag_present) 1
- <1><b1f>: Abbrev Number: 16 (DW_TAG_variable)
-    <b20>   DW_AT_name        : (strp) (offset: 0x2d9f): PySuper_Type
-    <b24>   DW_AT_decl_file   : (data1) 2
-    <b25>   DW_AT_decl_line   : (data1) 229
-    <b26>   DW_AT_type        : (ref4) <0x4f7>, PyTypeObject, _typeobject
-    <b2a>   DW_AT_external    : (flag_present) 1
-    <b2a>   DW_AT_declaration : (flag_present) 1
- <1><b2a>: Abbrev Number: 15 (DW_TAG_variable)
-    <b2b>   DW_AT_name        : (strp) (offset: 0x2cc6): _Py_NoneStruct
-    <b2f>   DW_AT_decl_file   : (data1) 2
-    <b30>   DW_AT_decl_line   : (data2) 516
-    <b32>   DW_AT_type        : (ref4) <0x7ae>, PyObject, _object
-    <b36>   DW_AT_external    : (flag_present) 1
-    <b36>   DW_AT_declaration : (flag_present) 1
- <1><b36>: Abbrev Number: 15 (DW_TAG_variable)
-    <b37>   DW_AT_name        : (strp) (offset: 0x2c16): _Py_NotImplementedStruct
-    <b3b>   DW_AT_decl_file   : (data1) 2
-    <b3c>   DW_AT_decl_line   : (data2) 526
-    <b3e>   DW_AT_type        : (ref4) <0x7ae>, PyObject, _object
-    <b42>   DW_AT_external    : (flag_present) 1
-    <b42>   DW_AT_declaration : (flag_present) 1
- <1><b42>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <b43>   DW_AT_name        : (strp) (offset: 0x218d): bufferinfo
-    <b47>   DW_AT_byte_size   : (data1) 80
-    <b48>   DW_AT_decl_file   : (data1) 18
-    <b49>   DW_AT_decl_line   : (data1) 56
-    <b4a>   DW_AT_sibling     : (ref4) <0xbd3>
- <2><b4e>: Abbrev Number: 30 (DW_TAG_member)
-    <b4f>   DW_AT_name        : (string) buf
-    <b53>   DW_AT_decl_file   : (data1) 18
-    <b54>   DW_AT_decl_line   : (data1) 57
-    <b55>   DW_AT_type        : (ref4) <0x98>
